[
  {
    "title": "Reserve Bank of India (Credit Information Companies - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NOT38578CF3B232A694DBEAB2A9CE71848DCA1.PDF",
    "file_extracted_text": " \n \n      \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/386 \nCEPD.PRD.No.S1032/13.01.019/2025-26                                       January 14, 2026 \n \nReserve Bank of India (Credit Information Companies - Internal Ombudsman) \nDirections, 2026 \n \nIn exercise of the powers conferred by Section 11 of the Credit Information Companies \n(Regulation) Act, 2005, the Reserve Bank of India, being satisfied that it is necessary \nand expedient in the public interest so to do, hereby, issues the Directions hereinafter \nspecified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a Credit Information Companies (CIC) and ensure a speedy and \nmeaningful resolution of customer complaints by enabling a review before their \nrejection, by an apex level authority within the CIC.  \n \nChapter I  \nPreliminary \n \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Credit Information \nCompanies - Internal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all \nof the provisions of these Directions, either generally or in relation to any specified \nregulated entity. \n \n2 \n \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n3. Applicability \n(1)  \nThe provisions of these Directions shall be applicable to Credit Information \nCompanies, hereinafter collectively referred to as ‘CICs’ and individually as a ‘CIC’.  \n \n4. Definitions  \n(1) \n In these Directions, unless the context states otherwise, the terms herein shall \nbear the meanings assigned to them as below: \n(a) “Competent Authority” means Managing Director / Chief Executive Officer \nin the CIC; \n(b) “Complaint” means a representation in writing or through other modes \nalleging deficiency in service on the part of the CIC with or without seeking relief \nthereon;   \n(c) “Credit Information Company (CIC)” means a company as defined in the \nCompanies Act, 2013 and has been granted a certificate of registration under \nsub-section (2) of section 5 of the Credit Information Companies (Regulation) \nAct, 2005; \n(d) “Customer” means a person who uses, or is an applicant for, a service \nprovided by the CIC; \n(e) “Deficiency in service” means a shortcoming or an inadequacy in any \nservice, which the CIC is required to provide statutorily or otherwise, which may \nor may not result in financial loss or damage to the customer; \n(f) “Deputy Internal Ombudsman (Dy. IO)” means any person appointed under \nclause 6 of these Directions;  \n(g) “Financial Sector Regulatory Body” means regulatory body for financial \nsector entities and includes: \n(i) The Reserve Bank of India established under the Reserve Bank of \nIndia Act, 1934; \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n \n3 \n \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority \nof India Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority \nestablished under the Pension Fund Regulatory and Development \nAuthority Act, 2013; \n(h) “Internal Ombudsman (IO)” means any person appointed under clause 5 of \nthese Directions; \n(i) “Regulated Entity (RE)” means a commercial bank or payments bank or \nsmall finance bank or a non-banking financial company or a non-bank prepaid \npayment instrument issuer or a credit information company which are covered \nunder the purview of the Internal Ombudsman framework, or any other entity \nas may be specified by the Reserve Bank from time to time.  \n(2)    All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of \nIndia Act, 1934, the Credit Information Companies (Regulation) Act, 2005, the \nCredit Information Companies Rules, 2006, the Credit Information Companies \nRegulations, 2006, or the Reserve Bank - Integrated Ombudsman Scheme (as \namended from time to time) or regulations, directions and guidelines issued by the \nReserve Bank of India. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n4 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a \nGeneral Manager in the RE under the purview of the Internal Ombudsman framework \nor a Financial Sector Regulatory Body, having necessary skills and experience of \nminimum seven years of working in areas such as banking, non-banking finance, \nregulation, supervision, payment and settlement systems, credit information or \nconsumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall previously not have been employed, nor presently be employed, \nby the CIC or a holding, associate or subsidiary company of the CIC. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)   \nA person may work as the IO in more than one RE simultaneously at the \ndiscretion of the REs concerned, subject to the approval of the Consumer Protection \nCommittee of the Board of the appointing RE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to \na Deputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and \nexperience of minimum five years of working in areas such as banking, non-banking \nfinance, regulation, supervision, payment and settlement systems, credit information \nor consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall previously not have been employed, nor presently be \nemployed, by the CIC or a holding, associate or subsidiary company of the CIC. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n \n5 \n \n7.  Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)   \nEvery CIC shall appoint at least one IO.  \n(2)  \nThe Consumer Protection Committee of the Board of the CIC shall determine, \nat least once in a year, the number of IO/ Dy. IO to be appointed having due regard to \nvolume and complexity of the complaints received, and ensuring that the IO/ Dy. IO \nget sufficient time to apply his/her mind on the principles of fairness, equity and natural \njustice while reviewing the resolution provided by the CIC. \n(3)  \nWhile appointing additional IO / Dy. IO, the CIC shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases.  In such \ncases, the CIC may clearly define the jurisdiction of each IO / Dy. IO.  \n \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)    The appointment of the IO / Dy. IO in the CIC shall be contractual.  \n(2)  \nThe CIC shall ensure that the post of the IO does not remain vacant at any point \nof time. During the temporary absence of the IO, the Dy. IO may function as the IO.  \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent, the CIC may \ndesignate its serving official equivalent to the General Manager rank as the IO for a \nperiod not exceeding one month, with the approval of the Customer Protection \nCommittee of the Board. Such official shall not have any reporting relationship with the \nbusiness verticals of the CIC during the period in which he/she is designated as the \nIO.  \n(4)  \nThe tenure of the IO / Dy. IO in the CIC shall be a fixed term of not less than \nthree years. However, the total tenure (including extension/reappointment, if any) of \nthe IO / Dy. IO in the CIC shall not exceed five years.  \n(5)  \nTo fill a vacancy, the CIC shall undertake the process of fresh appointment at \nleast three months in advance of the expiry of the tenure of the incumbent IO and \nensure that there is a reasonable overlap between the time of demitting of office of the \noutgoing IO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her \ncontracted term without the approval of the Consumer Protection Committee of the \nBoard. In case a vacancy arises on account of reasons beyond the control of the CIC \n(such as resignation, incapacitation, illness, death, etc.), the CIC shall inform Reserve \n \n6 \n \nBank of India within 10 working days from the date of such vacancy and shall appoint \na new IO / Dy. IO as per eligibility criteria specified under clause 5 and clause 6 of \nthese Directions within three months from the date of vacancy.  \n(7)    The Consumer Protection Committee of the CIC shall determine the structure \nof emoluments, facilities and benefits accorded to the IO / Dy. IO, which should be \nappropriate keeping in view the stature and position of the IO / Dy. IO being at the \napex of the grievance redress mechanism of the CIC as also the need to attract \nexperienced persons with requisite expertise. These emoluments, facilities and \nbenefits accorded to the IO / Dy. IO, once determined, shall not be changed adversely \nduring the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(a) \nof the Directions, of the CIC administratively, and to the Consumer Protection \nCommittee of the Board of the CIC functionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe CIC shall provide such number of its officers and staff to the office of the \nIO as is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge \nthe responsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the CIC.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the CIC shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of \nthe human resources and infrastructure provided to the office of the IO in \nrelation to the volume of complaints; \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n \n7 \n \n(c) Action taken by the office of the IO with regard to analysis of complaints, \nreports submitted to the Reserve Bank of India  and the CIC, raising awareness \nof the staff of the CIC about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the CIC to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness \nof decisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have \nalready been examined by the CIC but have been partially resolved or being wholly \nrejected by the CIC. \n(2)  \nThe IO / Dy. IO shall not represent the CIC in legal cases before any court or \nfora or authority. \n(3)  \n While the IO may decide any or all complaints, the power for the Dy. IO to \ndecide the complaints may be defined under a policy approved by the Consumer \nProtection Committee of the Board.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, \nif any, and as per the compensation policy of the CIC, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank- \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered \nby the complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the CIC, such as entity-wise, category-wise, consumer group-wise, \ngeographical location-wise, etc., and provide inputs to the CIC for policy intervention, \nif so warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nCIC.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \nOmbudsman / Appellate Authority. The CIC shall seek such access for the IO / Dy. IO \nfrom the Consumer Education and Protection Department of the Reserve Bank.  \n \n9 \n \n(9)  \nThe Dy. IO shall functionally report to the IO.  \n \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the \nConsumer Protection Committee of the Board. In CICs having multiple IOs, a view \nshall be taken by the Consumer Protection Committee of the Board to have \nrepresentation of more than one IO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on \nhis / her activities to the Consumer Protection Committee of the Board, preferably at \nquarterly, but not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(a) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Consumer Protection Committee of \nthe Board of the CIC for review.  \n(5)  \nInformation on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Consumer \nProtection Committee of the Board, on quarterly basis.  The information shall be \naccompanied with an analysis of minimum top five categories of complaints along with \nremedial measures so as to avoid complaints of a similar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n10 \n \nChapter - IV \nProcedural Guidelines for CIC \n \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nCIC and access to the System shall be provided to the IO / Dy. IO.  All complaints that \nare partially resolved or wholly rejected by the CIC’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review within 25 days of \nreceipt.  \n(2)  \nThe CIC shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording \nthe decision on the complaints before escalation to the office of IO. The complaints \noutside the purview of the IO / Dy. IO under the clauses 14(5)(c) to 14(5)(e) are \nexempted from such classification. \n(3)  \nThe CIC shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe CIC shall ensure that a complaint is not closed by the same branch / unit / \nother touch points, whether it has been resolved (fully or partially) or rejected. A \ncomplaint which is being wholly rejected or partially resolved shall be reviewed at a \nfairly senior level, which the CIC may decide as deemed fit, before sending it to the \noffice of IO.  \n(5)   \nThe following types of complaints shall be outside the purview of these \nDirections and shall not be handled by the IO/ Dy. IO: \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nCIC that do not impact the customer in any manner; \nb) References in the nature of suggestions and commercial decisions of CIC. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will \nbe valid complaints for the office of the IO;   \nc) Complaints / references relating to (i) internal administration, (ii) human \nresources, or (iii) pay and emoluments of staff in the CIC; \n \n11 \n \nd) Complaints which have been decided by or are already pending in judicial / \nquasi-judicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe CIC shall forward all rejected / partially resolved complaints under the categories \n(a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in service in \nsuch cases and take a view whether any of these complaints can be exempted under \n(a) and / or (b) above as decided by the CIC. Complaints that are outside the purview \nof these Directions shall be immediately returned back to the CIC by the IO / Dy. IO. \n(6)  \nThe IO / Dy. IO shall examine the complaints based on records available with \nthe CIC, including any documents submitted by the complainant and comments/ \nclarifications furnished by the CIC to the specific queries of the IO. The IO may seek \nadditional information, if necessary, from the concerned Credit Institution/s (CI) \nthrough the CIC. \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the CIC \nand seek any additional record / document available with the CIC that are necessary \nfor examining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe CIC shall ensure that the final decision is communicated to the complainant \nwithin a period of 30 days from the date of receipt of complaint by the CIC.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n(11)  Where the IO / Dy. IO upholds the decision of the CIC to reject or partially \nresolve the complaint, the reply to the complainant should explicitly state that the said \ncomplaint has been reviewed by the IO / Dy. IO.  \n(12)   For complaints that are partially resolved or wholly rejected after examination \nby the IO / Dy. IO, the CIC shall advise the complainant about the option of \napproaching the RBI Ombudsman for redress (excluding complaints not covered \nunder the Reserve Bank - Integrated Ombudsman Scheme, as amended from time to \ntime) along with complete details of the complaint. The CIC in its reply shall also \nmention the URL of Reserve Bank’s Complaint Management System portal for online \n \n12 \n \nfiling of customer complaints (https://cms.rbi.org.in) and the physical / email address \nof the Centralised Receipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO/ \nDy. IO shall be mandatorily included in the information to be submitted by the CIC to \nthe RBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In case, \nthe complaint was not earlier reviewed by the IO / Dy. IO, the CIC shall necessarily \nseek his/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The CIC shall use the analysis of complaints handled by IO / Dy. IO in the \ntraining programmes / conferences to raise awareness about the pattern of complaints \nincluding the root causes, remedial measures, etc., among the frontline staff, in order \nto evolve consistency in handling of complaints. The IO / Dy. IO may also be involved \nin such trainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the \nCIC in the redress of complaints, the Consumer Protection Committee of the Board \nshall also analyse the number of cases where there is substantive difference between \nthe decisions of the IO / Dy. IO vis-à-vis those given by the RBI Ombudsman \nsubsequently. \n(16)  The CIC shall widely disseminate the guidelines / instructions regarding these \nDirections among the staff while communicating the appointment of IO/ Dy. IO within \nthe organization (all branches and administrative offices). \n(17)  The CIC shall not provide the contact details of the IO / Dy. IO in the public \ndomain as the IO / Dy. IO shall not handle complaints received directly from the \ncustomers. \n \n \n \n \n \n \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n13 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by \nthe Department of Supervision of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may \nreview the cases where the decision of the IO / Dy. IO has not been accepted by the \nCIC and the aggrieved complainant approaches the RBI Ombudsman, for assessing \nthe effectiveness of the internal grievance redress mechanism of the CIC and initiating \ncorrective actions as it may deem fit. \n \n16.  Reporting to Reserve Bank  \n(1)     The CIC shall, within five working days of appointment of the IO or Dy. IO, furnish \nthe details of the official so appointed to the Consumer Education and Protection \nDepartment, Central Office, Reserve Bank of India (email: iocepd@rbi.org.in) in the \nfollowing format: \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2)    The CIC shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of \nIndia, on a quarterly basis as per format provided in the Annexure. The report shall \nbe submitted on or before the 15th day of the month following the quarter to which it \nrelates to. \n \n \n14 \n \nChapter - VI \nRepeal Provisions \n \n17. Repeal of the existing Schemes  \n(1)  \nWith the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, \n2023 issued by the Reserve Bank stands repealed.  \n(2)  \nAll appointments / actions under the aforesaid Master Direction, prior to the \ncoming into effect of these Directions, shall be deemed to have been made under \nthese Directions.  \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n15 \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended :  \nName of the CIC : \nPart I : Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No \nParticulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n8 \nOf (4 & 5), number of complaints wholly rejected \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n25 days of receipt \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 25 \ndays of receipt  \n \n13 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n14 \nOf (13), number of complaints where IO / Dy.IO has upheld the \ndecision of the CIC \n15 \nOf (13), number of complaints where IO / Dy.IO has not upheld \nthe decision of the CIC \n \n \n16 \nOf (15), number of complaints where the decision of the IO / \nDy.IO implemented by the CIC \n17 \nOf (15), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n18 \nOf(15), number of complaints where the CIC has disagreed \nwith the decision of IO / Dy.IO, with the approval of the \nCompetent Authority \n \n16 \n \nS.No \nParticulars \nNumber \n19 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n20 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n21 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n22 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Consumer \nProtection Committee of the Board. \n \n \n",
    "extracted_links": [
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) and Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre (CRPC) crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in)"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Entities) Directions, 2023 dated December 29,"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "2023 (2)"
      }
    ],
    "important_dates": [
      {
        "date": "January 14, 2026",
        "context": "6                                       January 14, 2026    Reserve Bank of India (Credit Inform"
      },
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      }
    ]
  },
  {
    "title": "Reserve Bank of India (Non-Bank Prepaid Payment Instruments Issuers - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/384MD14012026E275757688DE4E68AF9813B3B9491E4B.PDF",
    "file_extracted_text": " \n \n   \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/385 \nCEPD.PRD.No.S1031/13.01.019/2025-26                                          January 14, 2026 \n \nReserve Bank of India (Non-Bank Prepaid Payment Instruments Issuers - Internal \nOmbudsman) Directions, 2026 \n \nIn exercise of the powers conferred by Section 18 of the Payment and Settlement \nSystems Act, 2007, the Reserve Bank of India, being satisfied that it is necessary and \nexpedient in the public interest so to do, hereby, issues the Directions hereinafter \nspecified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a non-bank prepaid payment instruments issuer and ensure a speedy \nand meaningful resolution of customer complaints by enabling a review before their \nrejection, by an apex level authority within the non-bank prepaid payment instruments \nissuer.  \nChapter I  \nPreliminary \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Non-Bank Prepaid \nPayment Instruments Issuers - Internal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all of \nthe provisions of these Directions, either generally or in relation to any specified regulated \nentity. \n \n2 \n \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n3. Applicability \n(1)  \nThese Directions shall be applicable to Non-Bank Prepaid Payment Instruments \nIssuers (hereinafter collectively referred to as 'PPI issuers' and individually as a 'PPI \nissuer') as defined under clause 4(1)(h) of these Directions and having more than one \ncrore Prepaid Payment Instruments outstanding as on March 31, 2025, or thereafter. \n(2)  \nThe directions shall also be applicable to the PPI issuers, which meets the above \nmentioned criteria after March 31, 2025, with effect from six months from meeting the \neligibility criteria. The directions shall continue to remain applicable to a PPI issuer, even \nif the number of Prepaid Payment Instruments outstanding falls below the threshold at a \nlater date. \n \n4. Definitions  \n(1)  \nIn these Directions, unless the context states otherwise, the terms herein shall bear \nthe meanings assigned to them as below: \n (a) “Competent Authority” means Managing Director/ Chief Executive Officer of \nthe PPI issuer; \n(b) “Complaint” means a representation in writing or through other modes alleging \ndeficiency in service on the part of the PPI issuer with or without seeking relief \nthereon;  \n(c) “Customer” means a person who uses, or is an applicant for, a service provided \nby the PPI issuer; \n(d) “Deficiency in service” means a shortcoming or an inadequacy in any service, \nwhich the PPI issuer is required to provide statutorily or otherwise, which may or \nmay not result in financial loss or damage to the customer; \n(e) “Deputy Internal Ombudsman (Dy. IO)” means any person appointed under \nclause 6 of these Directions;  \n(f) “Financial Sector Regulatory Body” means regulatory body for financial sector \nentities and includes: \n \n3 \n \n(i) The Reserve Bank of India established under the Reserve Bank of India \nAct, 1934; \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority of \nIndia Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority established \nunder the Pension Fund Regulatory and Development Authority Act, 2013; \n(g) “Internal Ombudsman (IO)” means any person appointed under clause 5 of \nthese Directions; \n(h) “Non-Bank Prepaid Payment Instruments Issuer” means a company, as defined \nin the Companies Act, 2013, which has been granted a Certificate of Authorisation \nby the Reserve Bank of India under Section 7(1) of the Payment and Settlement \nSystems Act, 2007 (51 of 2007) to operate as a Prepaid Payment Instrument \nIssuer (PPI);  \n(i) “Regulated Entity (RE)” means a commercial bank or payments bank or small \nfinance bank or a non-banking financial company or a non-bank prepaid payment \ninstrument issuer or a credit information company which are covered under the \npurview of the Internal Ombudsman framework, or any other entity as may be \nspecified by the Reserve Bank from time to time.  \n(2) All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of India \nAct, 1934, the Payment and Settlement Systems Act, 2007, the Credit Information \nCompanies (Regulation) Act, 2005, the Credit Information Companies Rules, 2006, the \nCredit Information Companies Regulations, 2006, or the Reserve Bank - Integrated \nOmbudsman Scheme (as amended from time to time) or regulations, directions and \nguidelines issued by the Reserve Bank of India. \n \n \n \n \n4 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a General \nManager in the RE under the purview of the Internal Ombudsman framework or a \nFinancial Sector Regulatory Body, having necessary skills and experience of minimum \nseven years of working in areas such as banking, non-banking finance, regulation, \nsupervision, payment and settlement systems, credit information or consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall previously not have been employed, nor presently be employed, by \nthe PPI issuer or a holding, associate or subsidiary company of the PPI issuer. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nA person may work as the IO in more than one RE simultaneously at the discretion \nof the REs concerned, subject to the approval of the Board or Customer Service \nCommittee / Consumer Protection Committee of the Board of the appointing RE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to a \nDeputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and experience \nof minimum five years of working in areas such as banking, non-banking finance, \nregulation, supervision, payment and settlement systems, credit information or consumer \nprotection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall previously not have been employed, nor presently be employed, \nby the PPI issuer or a holding, associate or subsidiary company of the PPI issuer. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n5 \n \n7. Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)  \nEvery eligible PPI issuer shall appoint at least one IO.  \n(2)  \nThe Board of the PPI issuer shall determine, at least once in a year, the number \nof IO/ Dy. IO to be appointed having due regard to volume and complexity of the \ncomplaints received, and ensuring that the IO/ Dy. IO get sufficient time to apply his/her \nmind on the principles of fairness, equity and natural justice while reviewing the resolution \nprovided by the PPI issuer. \n(3)  \nWhile appointing additional IO / Dy. IO, the PPI issuer shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases. In such \ncases, the PPI issuer may clearly define the jurisdiction of each IO / Dy. IO.  \n \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)   The appointment of the IO / Dy. IO in the PPI issuer shall be contractual.  \n(2)  \nThe PPI issuer shall ensure that the post of the IO does not remain vacant at any \npoint of time. During the temporary absence of the IO, the Dy. IO may function as the IO.  \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent, the PPI issuer \nmay designate its serving official equivalent to the General Manager rank as the IO for a \nperiod not exceeding one month, with the approval of the Board. Such official shall not \nhave any reporting relationship with the business verticals of the PPI issuer during the \nperiod in which he/she is designated as the IO.  \n(4)  \nThe tenure of the IO / Dy. IO in the PPI issuer shall be a fixed term of not less than \nthree years. However, the total tenure (including extension/reappointment, if any) of the \nIO / Dy. IO in the PPI issuer shall not exceed five years.  \n(5)  \nTo fill a vacancy, the PPI issuer shall undertake the process of fresh appointment \nat least three months in advance of the expiry of the tenure of the incumbent IO and \nensure that there is a reasonable overlap between the time of demitting of office of the \noutgoing IO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her contracted \nterm without the approval of the Board. In case a vacancy arises on account of reasons \nbeyond the control of the PPI issuer (such as resignation, incapacitation, illness, death, \n \n6 \n \netc.), the PPI issuer shall inform Reserve Bank of India within 10 working days from the \ndate of such vacancy and shall appoint a new IO / Dy. IO as per eligibility criteria specified \nunder clause 5 and clause 6 of these Directions within three months from the date of \nvacancy.  \n(7)    The Board of the PPI issuer shall determine the structure of emoluments, facilities \nand benefits accorded to the IO / Dy. IO, which should be appropriate keeping in view \nthe stature and position of the IO / Dy. IO being at the apex of the grievance redress \nmechanism of the PPI issuer as also the need to attract experienced persons with \nrequisite expertise. These emoluments, facilities and benefits accorded to the IO / Dy. \nIO, once determined, shall not be changed adversely during the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(a) of \nthe Directions, of the PPI issuer administratively, and to the Board of the PPI issuer \nfunctionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe PPI issuer shall provide such number of its officers and staff to the office of \nthe IO as is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge the \nresponsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the PPI issuer.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the PPI issuer shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of the \nhuman resources and infrastructure provided to the office of the IO in relation to \nthe volume of complaints; \n \n7 \n \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n(c) Action taken by the office of the IO with regard to analysis of complaints, reports \nsubmitted to the Reserve Bank of India and the PPI issuer, raising awareness of \nthe staff of the PPI issuer about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the PPI issuer to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness of \ndecisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have already \nbeen examined by the PPI issuer but have been partially resolved or being wholly rejected \nby the PPI issuer. \n(2)  \nThe IO / Dy. IO shall not represent the PPI issuer in legal cases before any court \nor fora or authority. \n(3)  \n While the IO may decide any or all complaints, the power for the Dy. IO to decide \nthe complaints may be defined under a policy approved by the Board.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, if \nany, and as per the compensation policy of the PPI issuer, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank - \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered by \nthe complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the PPI issuer, such as product-wise, category-wise, consumer group-\nwise, geographical location-wise, etc., and provide inputs to the PPI issuer for policy \nintervention, if so warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nPPI issuer.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \n \n9 \n \nOmbudsman/ Appellate Authority. The PPI issuer shall seek such access for the IO / Dy. \nIO from the Consumer Education and Protection Department of the Reserve Bank.  \n(9) The Dy. IO shall functionally report to the IO.  \n \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the Board. \nIn PPI issuers having multiple IOs, a view shall be taken by the Board to have \nrepresentation of more than one IO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on his / \nher activities to the Board, preferably at quarterly, but not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(a) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Board of the PPI issuer for review.  \n(5)  \nInformation on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Board, on quarterly \nbasis. The information shall be accompanied with an analysis of minimum top five \ncategories of complaints along with remedial measures so as to avoid complaints of a \nsimilar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n10 \n \nChapter - IV \nProcedural Guidelines for PPI issuers \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nPPI issuer and access to the System shall be provided to the IO / Dy. IO. All complaints \nthat are partially resolved or wholly rejected by the PPI issuer’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review;  \na) in case of complaints, for which Reserve Bank of India, National Payments \nCorporation of India, or card network guidelines prescribe a timeline for resolution, \nsufficiently in advance such that IO / Dy. IO gets at least 10 days for review of such \ncomplaints to enable final decision to be communicated to the complainants within \nthe timelines prescribed by Reserve Bank of India, National Payments Corporation \nof India, or card network, as applicable; \nb) in all other cases, within 20 days of receipt.  \n(2)  \nThe PPI issuer shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording the \ndecision on the complaints before escalation to the office of IO. The complaints outside \nthe purview of the IO / Dy. IO under the clauses 14(5)(c) to 14(5)(e) are exempted from \nsuch classification. \n(3)  \nThe PPI issuer shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe PPI issuer shall ensure that a complaint is not closed by the same branch / \nunit / other touch points, whether it has been resolved (fully or partially) or rejected. A \ncomplaint which is being wholly rejected or partially resolved shall be reviewed at a fairly \nsenior level, which the PPI issuer may decide as deemed fit, before sending it to the office \nof IO.  \n(5)  \nThe following types of complaints shall be outside the purview of these Directions \nand shall not be handled by the IO/ Dy. IO: \n \n11 \n \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nPPI issuer that do not impact the customer in any manner; \nb) References in the nature of suggestions and commercial decisions of PPI issuer. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will be \nvalid complaints for the office of the IO;  \nc) Complaints / references relating to (i) internal administration, (ii) human resources, \nor (iii) pay and emoluments of staff in the PPI issuer; \nd) Complaints which have been decided by or are already pending in judicial / quasi-\njudicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe PPI issuer shall forward all rejected / partially resolved complaints under the \ncategories (a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in \nservice in such cases and take a view whether any of these complaints can be exempted \nunder (a) and / or (b) above as decided by the PPI issuer. Complaints that are outside the \npurview of these Directions shall be immediately returned back to the PPI issuer by the \nIO / Dy. IO. \n(6)  \nThe IO / Dy. IO shall examine the complaints based on records available with the \nPPI issuer, including any documents submitted by the complainant and comments/ \nclarifications furnished by the PPI issuer to the specific queries of the IO.  \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the PPI \nissuer and seek any additional record / document available with the PPI issuer that are \nnecessary for examining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe PPI issuer shall ensure that the final decision is communicated to the \ncomplainant within a period of 30 days from the date of receipt of complaint by the PPI \nissuer.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n \n12 \n \n(11)  Where the IO / Dy. IO upholds the decision of the PPI issuer to reject or partially \nresolve the complaint, the reply to the complainant should explicitly state that the said \ncomplaint has been reviewed by the IO / Dy. IO.  \n(12)   For complaints that are partially resolved or wholly rejected after examination by \nthe IO / Dy. IO, the PPI issuer shall advise the complainant about the option of \napproaching the RBI Ombudsman for redress (excluding complaints not covered under \nthe Reserve Bank - Integrated Ombudsman Scheme, as amended from time to time) \nalong with complete details of the complaint. The PPI issuer in its reply shall also mention \nthe URL of Reserve Bank’s Complaint Management System portal for online filing of \ncustomer complaints (https://cms.rbi.org.in) and the physical / email address of the \nCentralised Receipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO / \nDy. IO shall be mandatorily included in the information to be submitted by the PPI issuer \nto the RBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In case, \nthe complaint was not earlier reviewed by the IO / Dy. IO, the PPI issuer shall necessarily \nseek his/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The PPI issuer shall use the analysis of complaints handled by IO / Dy. IO in the \ntraining programmes / conferences to raise awareness about the pattern of complaints \nincluding the root causes, remedial measures, etc., among the frontline staff, in order to \nevolve consistency in handling of complaints. The IO / Dy. IO may also be involved in \nsuch trainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the PPI \nissuer in the redress of complaints, the Board shall also analyse the number of cases \nwhere there is substantive difference between the decisions of the IO / Dy. IO vis-à-vis \nthose given by the RBI Ombudsman subsequently. \n(16)  The PPI issuer shall widely disseminate the guidelines / instructions regarding \nthese Directions among the staff while communicating the appointment of IO/ Dy. IO \nwithin the organization (all branches and administrative offices). \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n13 \n \n(17)  The PPI issuer shall not provide the contact details of the IO / Dy. IO in the public \ndomain as the IO / Dy. IO shall not handle complaints received directly from the \ncustomers. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n14 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by the \nDepartment of Payment and Settlement Systems of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may review \nthe cases where the decision of the IO / Dy. IO has not been accepted by the PPI issuer \nand the aggrieved complainant approaches the RBI Ombudsman, for assessing the \neffectiveness of the internal grievance redress mechanism of the PPI issuer and initiating \ncorrective actions as it may deem fit. \n \n16. Reporting to Reserve Bank  \n(1)  The PPI issuer shall, within five working days of appointment of the IO or Dy. IO, \nfurnish the details of the official so appointed to the Consumer Education and Protection \nDepartment, Central Office, Reserve Bank of India (email: iocepd@rbi.org.in) in the \nfollowing format: \n \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2) The PPI issuer shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of India, \non a quarterly basis as per format provided in the Annexure. The report shall be \n \n15 \n \nsubmitted on or before the 15th day of the month following the quarter to which it relates \nto. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n16 \n \nChapter - VI \nRepeal Provisions \n17. Repeal of the existing Schemes  \n(1)  \nWith the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 \nissued by the Reserve Bank stands repealed.  \n(2)  \nAll appointments / actions under the aforesaid Master Direction, prior to the coming \ninto effect of these Directions, shall be deemed to have been made under these \nDirections.  \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n17 \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended:  \nName of the PPI issuer: \nPart I: Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No Particulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n \n8 \nOf (4 & 5), number of complaints wholly rejected \n \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \n \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n20 days of receipt \n \n \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 20 \ndays of receipt  \n \n \n13 \nOf (12), number of complaints referred to the IO / Dy.IO \nbeyond 20 days due to Turnaround Time prescribed by RBI, \nNPCI or card networks  \n \n \n14 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n \n \n15 \nOf (14), number of complaints where IO / Dy.IO has upheld the \ndecision of the PPI issuer \n \n \n16 \nOf (14), number of complaints where IO / Dy.IO has not upheld \nthe decision of the PPI issuer \n \n \n17 \nOf (16), number of complaints where the decision of the IO / \nDy.IO implemented by the PPI issuer \n \n \n \n18 \n \nS.No Particulars \nNumber \n18 \nOf (16), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n19 \nOf (16), number of complaints where the PPI issuer has \ndisagreed with the decision of IO / Dy.IO, with the approval of \nthe Competent Authority \n \n \n20 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n21 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n \n \n22 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n \n23 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Board. \n \n \n",
    "extracted_links": [
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) and Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in)"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Directions, 2023 dated December 29, 2023"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      }
    ],
    "important_dates": [
      {
        "date": "January 14, 2026",
        "context": "January 14, 2026    Reserve Bank of India (Non-Bank Prep"
      },
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      },
      {
        "date": "March 31, 2025",
        "context": "d Payment Instruments outstanding as on March 31, 2025, or thereafter.  (2)   The directions s"
      },
      {
        "date": "March 31, 2025",
        "context": "ets the above  mentioned criteria after March 31, 2025, with effect from six months from meeti"
      },
      {
        "date": "December 29, 2023",
        "context": "ulated Entities) Directions, 2023 dated December 29, 2023  issued by the Reserve Bank stands repe"
      }
    ]
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/383MD14012026559E41DD96224880B75EDB2B96E4BD8B.PDF",
    "file_extracted_text": " \n \n      \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/384 \nCEPD.PRD.No.S1030/13.01.019/2025-26                                \n \n   January 14, 2026 \n \nReserve Bank of India (Non-Banking Financial Companies - Internal Ombudsman) \nDirections, 2026 \n \nIn exercise of the powers conferred by Section 45L read with 45M of the Reserve Bank \nof India Act, the Reserve Bank of India, being satisfied that it is necessary and expedient \nin the public interest so to do, hereby, issues the Directions hereinafter specified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a Non-Banking Financial Company (NBFC) and ensure a speedy and \nmeaningful resolution of customer complaints by enabling a review before their rejection, \nby an apex level authority within the NBFC.  \n \nChapter I  \nPreliminary \n \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Non-Banking Financial \nCompanies - Internal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all of \nthe provisions of these Directions, either generally or in relation to any specified regulated \nentity. \n \n2 \n \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n3. Applicability \n(1)  \nThese directions shall be applicable to NBFCs (excluding Housing Finance \nCompany, Core Investment Company, Infrastructure Debt Fund-Non-Banking Financial \nCompany, Non-Banking Financial Company - Infrastructure Finance Company, Non-\nOperative Financial Holding Company, Primary dealers, Mortgage Guarantee Company) \nas defined under clause 4(1)(i) of these Directions and fulfilling the following criteria as \non March 31, 2025: \n(i) Deposit-taking NBFCs (NBFCs-D) with 10 or more branches;  \n(ii) Non-Deposit taking NBFCs (NBFCs-ND) with asset size of Rs.5,000 crore and \nabove and having public customer interface; \n(2)  \nThe directions shall also be applicable to an NBFC, which meets the above \nmentioned criteria after March 31, 2025, with effect from six months from meeting the \neligibility criteria; \n(3)  \nThese directions shall not be applicable to the NBFC under Corporate Insolvency \nResolution Process, NBFC in liquidation and / or winding up, or under directions of \nReserve Bank of India. \n \n4. Definitions  \n(1)  \nIn these Directions, unless the context states otherwise, the terms herein shall bear \nthe meanings assigned to them as below: \n(a) “Competent Authority” means Executive Director / Managing Director / Chief \nExecutive Officer in the NBFC; \n(b) “Complaint” means a representation in writing or through other modes alleging \ndeficiency in service on the part of the NBFC with or without seeking relief thereon;   \n(c) “Credit Information Company (CIC)” means a company as defined in the \nCompanies Act, 2013 and has been granted a certificate of registration under sub-\nsection (2) of section 5 of the Credit Information Companies (Regulation) Act, \n2005; \n \n3 \n \n(d) “Customer” means a person who uses, or is an applicant for, a service provided \nby the NBFC; \n(e) “Deficiency in service” means a shortcoming or an inadequacy in any service, \nwhich the NBFC is required to provide statutorily or otherwise, which may or may \nnot result in financial loss or damage to the customer; \n(f) “Deputy Internal Ombudsman (Dy. IO)” means any person appointed under \nclause 6 of these Directions;  \n(g) “Financial Sector Regulatory Body” means regulatory body for financial sector \nentities and includes: \n(i) The Reserve Bank of India established under the Reserve Bank of India \nAct, 1934; \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority of \nIndia Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority established \nunder the Pension Fund Regulatory and Development Authority Act, 2013; \n(h) “Internal Ombudsman (IO)” means any person appointed under clause 5 of \nthese Directions; \n(i) “Regulated Entity (RE)” means a commercial bank or payments bank or small \nfinance bank or a non-banking financial company or a non-bank prepaid payment \ninstrument issuer or a credit information company which are covered under the \npurview of the Internal Ombudsman framework, or any other entity as may be \nspecified by the Reserve Bank from time to time.  \n(2)  All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of India \nAct, 1934, the Payment and Settlement Systems Act, 2007, the Credit Information \nCompanies (Regulation) Act, 2005, the Credit Information Companies Rules, 2006, the \nCredit Information Companies Regulations, 2006, or the Reserve Bank - Integrated \n \n4 \n \nOmbudsman Scheme (as amended from time to time) or regulations, directions and \nguidelines issued by the Reserve Bank of India. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n5 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a General \nManager in the RE under the purview of the Internal Ombudsman framework or a \nFinancial Sector Regulatory Body, having necessary skills and experience of minimum \nseven years of working in areas such as banking, non-banking finance, regulation, \nsupervision, payment and settlement systems, credit information or consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall previously not have been employed, nor presently be employed, by \nthe NBFC or a holding, associate or subsidiary company of the NBFC. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)   \nA person may work as the IO in more than one RE simultaneously at the discretion \nof the REs concerned, subject to the approval of the Board or Customer Service \nCommittee / Consumer Protection Committee of the Board of the appointing RE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to a \nDeputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and experience \nof minimum five years of working in areas such as banking, non-banking finance, \nregulation, supervision, payment and settlement systems, credit information or consumer \nprotection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall previously not have been employed, nor presently be employed, \nby the NBFC or a holding, associate or subsidiary company of the NBFC. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n6 \n \n7.  Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)  \n Every NBFC shall appoint at least one IO.  \n(2)  \nThe Board of the NBFC shall determine, at least once in a year, the number of IO/ \nDy. IO to be appointed having due regard to volume and complexity of the complaints \nreceived, and ensuring that the IO/ Dy. IO get sufficient time to apply his/her mind on the \nprinciples of fairness, equity and natural justice while reviewing the resolution provided \nby the NBFC. \n(3)  \nWhile appointing additional IO / Dy. IO, the NBFC shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases.  In such \ncases, the NBFC may clearly define the jurisdiction of each IO / Dy. IO.  \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)    The appointment of the IO / Dy. IO in the NBFC shall be contractual.  \n(2)  \nThe NBFC shall ensure that the post of the IO does not remain vacant at any point \nof time. During the temporary absence of the IO, the Dy. IO may function as the IO.  \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent, the NBFC may \ndesignate its serving official equivalent to the General Manager rank as the IO for a period \nnot exceeding one month, with the approval of the Board. Such official shall not have any \nreporting relationship with the business verticals of the NBFC during the period in which \nhe/she is designated as the IO.  \n(4)  \nThe tenure of the IO / Dy. IO in the NBFC shall be a fixed term of not less than \nthree years. However, the total tenure (including extension/reappointment, if any) of the \nIO / Dy. IO in the NBFC shall not exceed five years.  \n(5)  \nTo fill a vacancy, the NBFC shall undertake the process of fresh appointment at \nleast three months in advance of the expiry of the tenure of the incumbent IO and ensure \nthat there is a reasonable overlap between the time of demitting of office of the outgoing \nIO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her contracted \nterm without the approval of the Board. In case a vacancy arises on account of reasons \nbeyond the control of the NBFC (such as resignation, incapacitation, illness, death, etc.), \nthe NBFC shall inform Reserve Bank of India within 10 working days from the date of \n \n7 \n \nsuch vacancy and shall appoint a new IO / Dy. IO as per eligibility criteria specified under \nclause 5 and clause 6 of these Directions within three months from the date of vacancy.  \n(7)    The Board of the NBFC shall determine the structure of emoluments, facilities and \nbenefits accorded to the IO / Dy. IO, which should be appropriate keeping in view the \nstature and position of the IO / Dy. IO being at the apex of the grievance redress \nmechanism of the NBFC as also the need to attract experienced persons with requisite \nexpertise. These emoluments, facilities and benefits accorded to the IO / Dy. IO, once \ndetermined, shall not be changed adversely during the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(a) of \nthe Directions, of the NBFC administratively, and to the Board of the NBFC functionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe NBFC shall provide such number of its officers and staff to the office of the IO \nas is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge the \nresponsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the NBFC.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the NBFC shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of the \nhuman resources and infrastructure provided to the office of the IO in relation to \nthe volume of complaints; \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n \n8 \n \n(c) Action taken by the office of the IO with regard to analysis of complaints, reports \nsubmitted to the Reserve Bank of India and the NBFC, raising awareness of the \nstaff of the NBFC about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the NBFC to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness of \ndecisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n9 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have already \nbeen examined by the NBFC but have been partially resolved or being wholly rejected by \nthe NBFC. \n(2)  \nThe IO / Dy. IO shall not represent the NBFC in legal cases before any court or \nfora or authority. \n(3)   \nWhile the IO may decide any or all complaints, the power for the Dy. IO to decide \nthe complaints may be defined under a policy approved by the Board.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, if \nany, and as per the compensation policy of the NBFC, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank – \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered by \nthe complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the NBFC, such as product-wise, category-wise, consumer group-wise, \ngeographical location-wise, etc., and provide inputs to the NBFC for policy intervention, if \nso warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nNBFC.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \n \n10 \n \nOmbudsman/ Appellate Authority. The NBFC shall seek such access for the IO / Dy. IO \nfrom the Consumer Education and Protection Department of the Reserve Bank.  \n(9)  \nThe Dy. IO shall functionally report to the IO.  \n \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the Board. \nIn NBFCs having multiple IOs, a view shall be taken by the Board to have representation \nof more than one IO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on his / \nher activities to the Board, preferably at quarterly, but not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(a) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Board of the NBFC for review.  \n(5)  Information on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Board, on quarterly \nbasis.  The information shall be accompanied with an analysis of minimum top five \ncategories of complaints along with remedial measures so as to avoid complaints of a \nsimilar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n11 \n \nChapter - IV \nProcedural Guidelines for NBFC \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nNBFC and access to the System shall be provided to the IO / Dy. IO.  All complaints that \nare partially resolved or wholly rejected by the NBFC’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review;  \na) in case of complaints, for which Reserve Bank of India, National Payments \nCorporation of India, or card network guidelines prescribe a timeline for resolution, \nsufficiently in advance such that IO / Dy. IO gets at least 10 days for review of such \ncomplaints to enable final decision to be communicated to the complainants within \nthe timelines prescribed by Reserve Bank of India, National Payments Corporation \nof India, or card network, as applicable; \nb) in all other cases, within 20 days of receipt.  \n(2)  \nThe NBFC shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording the \ndecision on the complaints before escalation to the office of IO. The complaints outside \nthe purview of the IO / Dy. IO under the clauses 14(5)(c) to 14(5)(e) are exempted from \nsuch classification. \n(3)  \nThe NBFC shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe NBFC shall ensure that a complaint is not closed by the same branch / unit / \nother touch points, whether it has been resolved (fully or partially) or rejected. A complaint \nwhich is being wholly rejected or partially resolved shall be reviewed at a fairly senior \nlevel, which the NBFC may decide as deemed fit, before sending it to the office of IO.  \n(5)   \nThe following types of complaints shall be outside the purview of these Directions \nand shall not be handled by the IO/ Dy. IO: \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nNBFC that do not impact the customer in any manner; \n \n12 \n \nb) References in the nature of suggestions and commercial decisions of NBFC. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will be \nvalid complaints for the office of the IO;   \nc) Complaints / references relating to (i) internal administration, (ii) human resources, \nor (iii) pay and emoluments of staff in the NBFC; \nd) Complaints which have been decided by or are already pending in judicial / quasi-\njudicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe NBFC shall forward all rejected / partially resolved complaints under the categories \n(a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in service in \nsuch cases and take a view whether any of these complaints can be exempted under (a) \nand / or (b) above as decided by the NBFC. Complaints that are outside the purview of \nthese Directions shall be immediately returned back to the NBFC by the IO / Dy. IO. \n(6)  \nThe IO / Dy. IO shall examine the complaints based on records available with the \nNBFC, including any documents submitted by the complainant and comments/ \nclarifications furnished by the NBFC to the specific queries of the IO.  \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the NBFC \nand seek any additional record / document available with the NBFC that are necessary \nfor examining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe NBFC shall ensure that the final decision is communicated to the complainant \nwithin a period of 30 days from the date of receipt of complaint by the NBFC.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n(11)  Where the IO / Dy. IO upholds the decision of the NBFC to reject or partially resolve \nthe complaint, the reply to the complainant should explicitly state that the said complaint \nhas been reviewed by the IO / Dy. IO.  \n \n13 \n \n(12)   For complaints that are partially resolved or wholly rejected after examination by \nthe IO / Dy. IO, the NBFC shall advise the complainant about the option of approaching \nthe RBI Ombudsman for redress (excluding complaints not covered under the Reserve \nBank - Integrated Ombudsman Scheme, as amended from time to time) along with \ncomplete details of the complaint. The NBFC in its reply shall also mention the URL of \nReserve Bank’s Complaint Management System portal for online filing of customer \ncomplaints (https://cms.rbi.org.in) and the physical / email address of the Centralised \nReceipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO / \nDy. IO shall be mandatorily included in the information to be submitted by the NBFC to \nthe RBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In case, \nthe complaint was not earlier reviewed by the IO / Dy. IO, the NBFC shall necessarily \nseek his/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The NBFC shall use the analysis of complaints handled by IO / Dy. IO in the \ntraining programmes / conferences to raise awareness about the pattern of complaints \nincluding the root causes, remedial measures, etc., among the frontline staff, in order to \nevolve consistency in handling of complaints. The IO / Dy. IO may also be involved in \nsuch trainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the \nNBFC in the redress of complaints, the Board shall also analyse the number of cases \nwhere there is substantive difference between the decisions of the IO / Dy. IO vis-à-vis \nthose given by the RBI Ombudsman subsequently. \n(16)  The NBFC shall widely disseminate the guidelines / instructions regarding these \nDirections among the staff while communicating the appointment of IO/ Dy. IO within the \norganization (all branches and administrative offices). \n(17)  The NBFC shall not provide the contact details of the IO / Dy. IO in the public \ndomain as the IO / Dy. IO shall not handle complaints received directly from the \ncustomers. \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n14 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by the \nDepartment of Supervision of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may review \nthe cases where the decision of the IO / Dy. IO has not been accepted by the NBFC and \nthe aggrieved complainant approaches the RBI Ombudsman, for assessing the \neffectiveness of the internal grievance redress mechanism of the NBFC and initiating \ncorrective actions as it may deem fit. \n \n16.  Reporting to Reserve Bank  \n(1)     The NBFC shall, within five working days of appointment of the IO or Dy. IO, furnish \nthe details of the official so appointed to the Consumer Education and Protection \nDepartment, Central Office, Reserve Bank of India (email: iocepd@rbi.org.in) in the \nfollowing format: \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2)    The NBFC shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of India, \non a quarterly basis as per format provided in the Annexure. The report shall be \n \n15 \n \nsubmitted on or before the 15th day of the month following the quarter to which it relates \nto. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n16 \n \nChapter - VI \nRepeal Provisions \n17. Repeal of the existing Schemes  \n(1) With the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 \nissued by the Reserve Bank stands repealed.  \n(2) All appointments / actions under the aforesaid Master Direction, prior to the coming \ninto effect of these Directions, shall be deemed to have been made under these \nDirections.  \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n17 \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended :  \nName of the NBFC : \nPart I: Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No Particulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n \n8 \nOf (4 & 5), number of complaints wholly rejected \n \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \n \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n20 days of receipt \n \n \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 20 \ndays of receipt  \n \n \n13 \nOf (12), number of complaints referred to the IO / Dy.IO \nbeyond 20 days due to Turnaround Time prescribed by RBI, \nNPCI or card networks  \n \n \n14 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n \n \n15 \nOf (14), number of complaints where IO / Dy.IO has upheld the \ndecision of the NBFC \n \n \n16 \nOf (14), number of complaints where IO / Dy.IO has not upheld \nthe decision of the NBFC \n \n \n17 \nOf (16), number of complaints where the decision of the IO / \nDy.IO implemented by the NBFC \n \n \n \n18 \n \nS.No Particulars \nNumber \n18 \nOf (16), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n19 \nOf (16), number of complaints where the NBFC has disagreed \nwith the decision of IO / Dy.IO, with the approval of the \nCompetent Authority \n \n \n20 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n21 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n \n \n22 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n \n23 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Board.  \n \n \n",
    "extracted_links": [
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in)"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Entities) Directions, 2023 dated December 29, 2023"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      }
    ],
    "important_dates": [
      {
        "date": "January 14, 2026",
        "context": "26                                      January 14, 2026    Reserve Bank of India (Non-Banking F"
      },
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      },
      {
        "date": "March 31, 2025",
        "context": "ulfilling the following criteria as  on March 31, 2025:  (i) Deposit-taking NBFCs (NBFCs-D) wi"
      },
      {
        "date": "March 31, 2025",
        "context": "ets the above  mentioned criteria after March 31, 2025, with effect from six months from meeti"
      },
      {
        "date": "December 29, 2023",
        "context": "ulated Entities) Directions, 2023 dated December 29, 2023  issued by the Reserve Bank stands repe"
      }
    ]
  },
  {
    "title": "Reserve Bank of India (Payments Banks - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NOT3821EAEF90E037B4061A91775A5525510C3.PDF",
    "file_extracted_text": " \n \n      \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/383 \nCEPD.PRD.No.S1028/13.01.019/2025-26                                    January  14, 2026 \n \nReserve Bank of India (Payments Banks - Internal Ombudsman) Directions, \n2026 \n \nIn exercise of the powers conferred by Section 35A of Banking Regulation Act, 1949, \nthe Reserve Bank of India, being satisfied that it is necessary and expedient in the \npublic interest so to do, hereby, issues the Directions hereinafter specified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a bank and ensure a speedy and meaningful resolution of customer \ncomplaints by enabling a review before their rejection, by an apex level authority within \nthe bank.  \n \nChapter I  \nPreliminary \n \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Payments Banks - \nInternal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all \nof the provisions of these Directions, either generally or in relation to any specified \nregulated entity. \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n \n2 \n \n3. Applicability \n(1)  \nThese Directions shall be applicable to Payments Banks (hereinafter \ncollectively referred to as 'banks' and individually as a 'bank') having 10 or more \nbanking outlets in India as on March 31, 2025.  \n(2)  \nThe directions shall also be applicable to the Payments Banks, which meets \nthe above mentioned criteria after March 31, 2025, with effect from six months from \nmeeting the eligibility criteria.   \n \n4. Definitions  \n(1) \n In these Directions, unless the context states otherwise, the terms herein shall \nbear the meanings assigned to them as below: \n(a) “Banking Outlet” is a fixed-point service delivery unit as defined under the \nReserve Bank of India (Payments Banks - Branch Authorisation) Directions, \n2025 issued by Reserve Bank of India, and as amended from time to time;  \n(b) “Competent Authority” means Whole Time Director / Executive Director-in-\ncharge of customer service vertical of the bank; \n(c) “Complaint” means a representation in writing or through other modes \nalleging deficiency in service on the part of the bank with or without seeking \nrelief thereon;   \n(d) “Credit Information Company (CIC)” means a company as defined in the \nCompanies Act, 2013 and has been granted a certificate of registration under \nsub-section (2) of section 5 of the Credit Information Companies (Regulation) \nAct, 2005; \n(e) “Customer” means a person who uses, or is an applicant for, a service \nprovided by the bank; \n(f) “Deficiency in service” means a shortcoming or an inadequacy in any \nservice, which the bank is required to provide statutorily or otherwise, which \nmay or may not result in financial loss or damage to the customer; \n(g) “Deputy Internal Ombudsman (Dy. IO)” means any person appointed under \nclause 6 of these Directions;  \n(h) “Financial Sector Regulatory Body” means regulatory body for financial \nsector entities and includes: \n(i) The Reserve Bank of India established under the Reserve Bank of \nIndia Act, 1934; \n \n3 \n \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority \nof India Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority \nestablished under the Pension Fund Regulatory and Development \nAuthority Act, 2013; \n(i) “Internal Ombudsman (IO)” means any person appointed under clause 5 of \nthese Directions; \n(j) “Regulated Entity (RE)” means a commercial bank or payments bank or \nsmall finance bank or a non-banking financial company or a non-bank prepaid \npayment instrument issuer or a credit information company which are covered \nunder the purview of the Internal Ombudsman framework, or any other entity \nas may be specified by the Reserve Bank from time to time.  \n(2)   All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of \nIndia Act, 1934, the Payment and Settlement Systems Act, 2007, the Credit \nInformation Companies (Regulation) Act, 2005, the Credit Information Companies \nRules, 2006, the Credit Information Companies Regulations, 2006, or the Reserve \nBank - Integrated Ombudsman Scheme (as amended from time to time) or \nregulations, directions and guidelines issued by the Reserve Bank of India. \n \n \n \n \n \n \n \n \n \n \n \n \n \n4 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a \nGeneral Manager in the RE under the purview of the Internal Ombudsman framework \nor a Financial Sector Regulatory Body, having necessary skills and experience of \nminimum seven years of working in areas such as banking, non-banking finance, \nregulation, supervision, payment and settlement systems, credit information or \nconsumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall not have been previously employed, nor presently be employed, \nby the bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)   \nA person may work as the IO in more than one RE simultaneously at the \ndiscretion of the REs concerned, subject to the approval of the Board or Customer \nService Committee / Consumer Protection Committee of the Board of the appointing \nRE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to \na Deputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and \nexperience of minimum five years of working in areas such as banking, non-banking \nfinance, regulation, supervision, payment and settlement systems, credit information \nor consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall not have been previously employed, nor presently be \nemployed, by the bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n \n5 \n \n \n7.  Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)   \nEvery bank shall appoint at least one IO.  \n(2)  \nThe Customer Service Committee of the Board of the bank shall determine, at \nleast once in a year, the number of IO/ Dy. IO to be appointed having due regard to \nvolume and complexity of the complaints received, and ensuring that the IO/ Dy. IO \nget sufficient time to apply his/her mind on the principles of fairness, equity and natural \njustice while reviewing the resolution provided by the bank. \n(3)  \nWhile appointing additional IO / Dy. IO, the bank shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases.  In such \ncases, the bank may clearly define the jurisdiction of each IO / Dy. IO.  \n \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)    The appointment of the IO / Dy. IO in the bank shall be contractual.  \n(2)  \nThe bank shall ensure that the post of the IO does not remain vacant at any \npoint of time. During the temporary absence of the IO, the Dy. IO may function as the \nIO. \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent, the bank may \ndesignate its serving official equivalent to the General Manager rank as the IO for a \nperiod not exceeding one month, with the approval of the Customer Service \nCommittee of the Board. Such official shall not have any reporting relationship with the \nbusiness verticals of the bank during the period in which he/she is designated as the \nIO.  \n(4)  \nThe tenure of the IO / Dy. IO in the bank shall be a fixed term of not less than \nthree years. However, the total tenure (including extension/reappointment, if any) of \nthe IO / Dy. IO in the bank shall not exceed five years.  \n(5)  \nTo fill a vacancy, the bank shall undertake the process of fresh appointment at \nleast three months in advance of the expiry of the tenure of the incumbent IO and \nensure that there is a reasonable overlap between the time of demitting of office of the \noutgoing IO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her \ncontracted term without the approval of the Customer Service Committee of the Board. \nIn case a vacancy arises on account of reasons beyond the control of the bank (such \n \n6 \n \nas resignation, incapacitation, illness, death, etc.), the bank shall inform Reserve Bank \nof India within 10 working days from the date of such vacancy and shall appoint a new \nIO / Dy. IO as per eligibility criteria specified under clause 5 and clause 6 of these \nDirections within three months from the date of vacancy.  \n(7)    The Customer Service Committee of the Board of the bank shall determine the \nstructure of emoluments, facilities and benefits accorded to the IO / Dy. IO, which \nshould be appropriate keeping in view the stature and position of the IO / Dy. IO being \nat the apex of the grievance redress mechanism of the bank as also the need to attract \nexperienced persons with requisite expertise. These emoluments, facilities and \nbenefits accorded to the IO / Dy. IO, once determined, shall not be changed adversely \nduring the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(b) \nof the Directions, of the bank administratively, and to the Customer Service Committee \nof the Board of the bank functionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe bank shall provide such number of its officers and staff to the office of the \nIO as is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge \nthe responsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the bank.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the bank shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of \nthe human resources and infrastructure provided to the office of the IO in \nrelation to the volume of complaints; \n \n7 \n \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n(c) Action taken by the office of the IO with regard to analysis of complaints, \nreports submitted to the Reserve Bank of India and the bank, raising awareness \nof the staff of the bank about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the bank to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness \nof decisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have \nalready been examined by the bank but have been partially resolved or being wholly \nrejected by the bank. \n(2)  \nThe IO / Dy. IO shall not represent the bank in legal cases before any court or \nfora or authority. \n(3)   \nWhile the IO may decide any or all complaints, the power for the Dy. IO to \ndecide the complaints may be defined under a policy approved by the Customer \nService Committee of the Board.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, \nif any, and as per the compensation policy of the bank, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank- \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered \nby the complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the bank, such as product-wise, category-wise, consumer group-\nwise, geographical location-wise, etc., and provide inputs to the bank for policy \nintervention, if so warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nbank.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \nOmbudsman / Appellate Authority. The bank shall seek such access for the IO / Dy. \nIO from the Consumer Education and Protection Department of the Reserve Bank.  \n(9)  \nThe Dy. IO shall functionally report to the IO.  \n \n9 \n \n \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the \nCustomer Service Committee of the Board. In banks having multiple IOs, a view shall \nbe taken by the Customer Service Committee of the Board to have representation of \nmore than one IO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on \nhis / her activities to the Customer Service Committee of the Board, preferably at \nquarterly, but not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(b) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Customer Service Committee of the \nBoard of the bank for review.  \n(5)   \nInformation on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Customer Service \nCommittee of the Board, on quarterly basis.  The information shall be accompanied \nwith an analysis of minimum top five categories of complaints along with remedial \nmeasures so as to avoid complaints of a similar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n10 \n \nChapter - IV \nProcedural Guidelines for Bank \n \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nbank and access to the System shall be provided to the IO / Dy. IO.  All complaints \nthat are partially resolved or wholly rejected by the bank’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review;  \na) in case of complaints, for which Reserve Bank of India, National Payments \nCorporation of India, or card network guidelines prescribe a timeline for \nresolution, sufficiently in advance such that IO / Dy. IO gets at least 10 days for \nreview of such complaints to enable final decision to be communicated to the \ncomplainants within the timelines prescribed by Reserve Bank of India, National \nPayments Corporation of India, or card network, as applicable; \nb) in all other cases, within 20 days of receipt.  \n(2)  \nThe bank shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording \nthe decision on the complaints before escalation to the office of IO. The complaints \noutside the purview of the IO / Dy. IO under the clauses 14(5)(c) to 14(5)(e) are \nexempted from such classification. \n(3)  \nThe bank shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe bank shall ensure that a complaint is not closed by the same branch/ unit / \nother touch points, whether it has been resolved (fully or partially) or rejected. A \ncomplaint which is being wholly rejected or partially resolved shall be reviewed at a \nfairly senior level, which the bank may decide as deemed fit, before sending it to the \noffice of IO.  \n(5)   \nThe following types of complaints shall be outside the purview of these \nDirections and shall not be handled by the IO/ Dy. IO: \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nbank that do not impact the customer in any manner; \n \n11 \n \nb) References in the nature of suggestions and commercial decisions of bank. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will \nbe valid complaints for the office of the IO;   \nc) Complaints / references relating to (i) internal administration, (ii) human \nresources, or (iii) pay and emoluments of staff in the bank; \nd) Complaints which have been decided by or are already pending in judicial / \nquasi-judicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe bank shall forward all rejected / partially resolved complaints under the categories \n(a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in service in \nsuch cases and take a view whether any of these complaints can be exempted under \n(a) and / or (b) above as decided by the bank. Complaints that are outside the purview \nof these Directions shall be immediately returned back to the bank by the IO / Dy. IO. \n(6)  \nThe IO / Dy. IO shall examine the complaints based on records available with \nthe bank, including any documents submitted by the complainant and comments/ \nclarifications furnished by the bank to the specific queries of the IO.  \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the bank \nand seek any additional record / document available with the bank that are necessary \nfor examining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe bank shall ensure that the final decision is communicated to the \ncomplainant within a period of 30 days from the date of receipt of complaint by the \nbank.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n(11)  Where the IO / Dy. IO upholds the decision of the bank to reject or partially \nresolve the complaint, the reply to the complainant should explicitly state that the said \ncomplaint has been reviewed by the IO / Dy. IO.  \n(12)   For complaints that are partially resolved or wholly rejected after examination \nby the IO / Dy. IO, the bank shall advise the complainant about the option of \napproaching the RBI Ombudsman for redress (excluding complaints not covered \n \n12 \n \nunder the Reserve Bank- Integrated Ombudsman Scheme, as amended from time to \ntime) along with complete details of the complaint. The bank in its reply shall also \nmention the URL of Reserve Bank’s Complaint Management System portal for online \nfiling of customer complaints (https://cms.rbi.org.in) and the physical / email address \nof the Centralised Receipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO \n/ Dy. IO shall be mandatorily included in the information to be submitted by the bank \nto the RBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In \ncase, the complaint was not earlier reviewed by the IO / Dy. IO, the bank shall \nnecessarily seek his/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The bank shall use the analysis of complaints handled by IO / Dy. IO in the \ntraining programmes / conferences to raise awareness about the pattern of complaints \nincluding the root causes, remedial measures, etc., among the frontline staff, in order \nto evolve consistency in handling of complaints. The IO / Dy. IO may also be involved \nin such trainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the \nbank in the redress of complaints, the Customer Service Committee of the Board shall \nalso analyse the number of cases where there is substantive difference between the \ndecisions of the IO / Dy. IO vis-à-vis those given by the RBI Ombudsman \nsubsequently. \n(16)  The bank shall widely disseminate the guidelines / instructions regarding these \nDirections among the staff while communicating the appointment of IO/ Dy. IO within \nthe organization (all branches and administrative offices). \n(17)  The bank shall not provide the contact details of the IO / Dy. IO in the public \ndomain as the IO / Dy. IO shall not handle complaints received directly from the \ncustomers. \n \n \n \n \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n13 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by \nthe Department of Supervision of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may \nreview the cases where the decision of the IO / Dy. IO has not been accepted by the \nbank and the aggrieved complainant approaches the RBI Ombudsman, for assessing \nthe effectiveness of the internal grievance redress mechanism of the bank and \ninitiating corrective actions as it may deem fit. \n \n16.  Reporting to Reserve Bank  \n(1)     The bank shall, within five working days of appointment of the IO or Dy. IO, \nfurnish the details of the official so appointed to the Consumer Education and \nProtection \nDepartment, \nCentral \nOffice, \nReserve \nBank \nof \nIndia \n(email: \niocepd@rbi.org.in) in the following format: \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2) The bank shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of \nIndia, on a quarterly basis as per format provided in the Annexure. The report shall \nbe submitted on or before the 15th day of the month following the quarter to which it \nrelates to. \n \n \n \n14 \n \nChapter - VI \nRepeal Provisions \n \n17. Repeal of the existing Schemes  \n(1)  \nWith the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, \n2023 issued by the Reserve Bank stands repealed.  \n(2)  \nAll appointments / actions under the aforesaid Master Direction, prior to the \ncoming into effect of these Directions, shall be deemed to have been made under \nthese Directions.  \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n15 \n \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended :  \nName of the Bank : \nPart I: Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No \nParticulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n8 \nOf (4 & 5), number of complaints wholly rejected \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n20 days of receipt \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 20 \ndays of receipt  \n \n13 \nOf (12), number of complaints referred to the IO / Dy.IO \nbeyond 20 days due to Turnaround Time prescribed by RBI, \nNPCI or card networks  \n \n \n14 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n15 \nOf (14), number of complaints where IO / Dy.IO has upheld the \ndecision of the bank \n \n \n16 \nOf (14), number of complaints where IO / Dy.IO has not upheld \nthe decision of the bank \n \n \n17 \nOf (16), number of complaints where the decision of the IO / \nDy.IO implemented by the bank \n18 \nOf (16), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n \n16 \n \nS.No \nParticulars \nNumber \n19 \nOf (16), number of complaints where the bank has disagreed \nwith the decision of IO / Dy.IO, with the approval of the \nCompetent Authority \n20 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n21 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n22 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n \n23 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Customer Service \nCommittee of the Board. \n \n \n",
    "extracted_links": [
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13102",
        "context": "Reserve Bank of India (Payments Banks - Branch Authorisation) Directions, 2025 issued by Reserve Bank of India, and as amended from time to time;"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13102",
        "context": "2025 (b) “Competent"
      },
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) and Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre (CRPC) crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in) 1. Name of the IO"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Entities) Directions, 2023 dated December 29,"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "2023 (2)"
      }
    ],
    "important_dates": [
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      },
      {
        "date": "March 31, 2025",
        "context": "or more  banking outlets in India as on March 31, 2025.   (2)   The directions shall also be a"
      },
      {
        "date": "March 31, 2025",
        "context": "ets  the above mentioned criteria after March 31, 2025, with effect from six months from  meet"
      }
    ]
  },
  {
    "title": "Reserve Bank of India (Small Finance Banks - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/381MD140120267212A1D4EF8349448E9416EF8F2D19B5.PDF",
    "file_extracted_text": " \n \n      \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/382 \nCEPD.PRD.No.S1029/13.01.019/2025-26                                         January 14, 2026 \n \nReserve Bank of India (Small Finance Banks - Internal Ombudsman) Directions, \n2026 \n \nIn exercise of the powers conferred by Section 35A of Banking Regulation Act, 1949, the \nReserve Bank of India, being satisfied that it is necessary and expedient in the public \ninterest so to do, hereby, issues the Directions hereinafter specified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a bank and ensure a speedy and meaningful resolution of customer \ncomplaints by enabling a review before their rejection, by an apex level authority within \nthe bank.  \n \nChapter I  \nPreliminary \n \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Small Finance Banks \n- Internal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all of \nthe provisions of these Directions, either generally or in relation to any specified regulated \nentity. \n \n2 \n \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n3. Applicability \n(1)  \nThese Directions shall be applicable to Small Finance Banks (hereinafter \ncollectively referred to as 'banks' and individually as a 'bank') having 10 or more banking \noutlets in India as on March 31, 2025.  \n(2)  \nThe directions shall also be applicable to the Small Finance bank, which meets \nthe above mentioned criteria after March 31, 2025, with effect from six months from \nmeeting the eligibility criteria.  \n \n4. Definitions  \n(1)  \nIn these Directions, unless the context states otherwise, the terms herein shall \nbear the meanings assigned to them as below: \n(a) “Banking Outlet” is a fixed-point service delivery unit as defined under the \nReserve Bank of India (Small Finance Banks - Branch Authorisation) Directions, \n2025 issued by Reserve Bank of India, and as amended from time to time;  \n(b) “Competent Authority” means Whole Time Director / Executive Director-in-\ncharge of customer service vertical of the bank; \n(c) “Complaint” means a representation in writing or through other modes alleging \ndeficiency in service on the part of the bank with or without seeking relief thereon;  \n(d) “Credit Information Company (CIC)” means a company as defined in the \nCompanies Act, 2013 and has been granted a certificate of registration under sub-\nsection (2) of section 5 of the Credit Information Companies (Regulation) Act, \n2005; \n(e) “Customer” means a person who uses, or is an applicant for, a service provided \nby the bank; \n(f) “Deficiency in service” means a shortcoming or an inadequacy in any service, \nwhich the bank is required to provide statutorily or otherwise, which may or may \nnot result in financial loss or damage to the customer; \n(g) “Deputy Internal Ombudsman (Dy. IO)” means any person appointed under \nclause 6 of these Directions;  \n \n3 \n \n(h) “Financial Sector Regulatory Body” means regulatory body for financial sector \nentities and includes: \n(i) The Reserve Bank of India established under the Reserve Bank of India \nAct, 1934; \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority of \nIndia Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority established \nunder the Pension Fund Regulatory and Development Authority Act, 2013; \n(i) “Internal Ombudsman (IO)” means any person appointed under clause 5 of \nthese Directions; \n(j) “Regulated Entity (RE)” means a commercial bank or payments bank or small \nfinance bank or a non-banking financial company or a non-bank prepaid payment \ninstrument issuer or a credit information company which are covered under the \npurview of the Internal Ombudsman framework, or any other entity as may be \nspecified by the Reserve Bank from time to time.  \n(2)  All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of India \nAct, 1934, the Payment and Settlement Systems Act, 2007, the Credit Information \nCompanies (Regulation) Act, 2005, the Credit Information Companies Rules, 2006, \nthe Credit Information Companies Regulations, 2006, or the Reserve Bank - Integrated \nOmbudsman Scheme (as amended from time to time) or regulations, directions and \nguidelines issued by the Reserve Bank of India. \n \n \n \n \n \n \n \n \n \n4 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a \nGeneral Manager in the RE under the purview of the Internal Ombudsman framework or \na Financial Sector Regulatory Body, having necessary skills and experience of minimum \nseven years of working in areas such as banking, non-banking finance, regulation, \nsupervision, payment and settlement systems, credit information or consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall not have been previously employed, nor presently be employed, by \nthe bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nA person may work as the IO in more than one RE simultaneously at the discretion \nof the REs concerned, subject to the approval of the Board or Customer Service \nCommittee / Consumer Protection Committee of the Board of the appointing RE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to a \nDeputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and \nexperience of minimum five years of working in areas such as banking, non-banking \nfinance, regulation, supervision, payment and settlement systems, credit information or \nconsumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall not have been previously employed, nor presently be employed, \nby the bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n \n \n5 \n \n \n7. Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)  \nEvery bank shall appoint at least one IO.  \n(2)  \nThe Customer Service Committee of the Board of the bank shall determine, at \nleast once in a year, the number of IO/ Dy. IO to be appointed having due regard to \nvolume and complexity of the complaints received, and ensuring that the IO/ Dy. IO get \nsufficient time to apply his/her mind on the principles of fairness, equity and natural justice \nwhile reviewing the resolution provided by the bank. \n(3)  \nWhile appointing additional IO / Dy. IO, the bank shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases. In such \ncases, the bank may clearly define the jurisdiction of each IO / Dy. IO.  \n \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)    The appointment of the IO / Dy. IO in the bank shall be contractual.  \n(2)  \nThe bank shall ensure that the post of the IO does not remain vacant at any point \nof time. During the temporary absence of the IO, the Dy. IO may function as the IO. \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent,, the bank may \ndesignate its serving official equivalent to the General Manager rank as the IO for a period \nnot exceeding one month, with the approval of the Customer Service Committee of the \nBoard. Such official shall not have any reporting relationship with the business verticals \nof the bank during the period in which he/she is designated as the IO.  \n(4)  \nThe tenure of the IO / Dy. IO in the bank shall be a fixed term of not less than three \nyears. However, the total tenure (including extension/reappointment, if any) of the IO / \nDy. IO in the bank shall not exceed five years.  \n(5)  \nTo fill a vacancy, the bank shall undertake the process of fresh appointment at \nleast three months in advance of the expiry of the tenure of the incumbent IO and ensure \nthat there is a reasonable overlap between the time of demitting of office of the outgoing \nIO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her contracted \nterm without the approval of the Customer Service Committee of the Board. In case a \nvacancy arises on account of reasons beyond the control of the bank (such as \nresignation, incapacitation, illness, death, etc.), the bank shall inform Reserve Bank of \nIndia within 10 working days from the date of such vacancy and shall appoint a new IO / \n \n6 \n \nDy. IO as per eligibility criteria specified under clause 5 and clause 6 of these Directions \nwithin three months from the date of vacancy.  \n(7)    The Customer Service Committee of the Board of the bank, as the case may be, \nshall determine the structure of emoluments, facilities and benefits accorded to the IO / \nDy. IO, which should be appropriate keeping in view the stature and position of the IO / \nDy. IO being at the apex of the grievance redress mechanism of the bank as also the \nneed to attract experienced persons with requisite expertise. These emoluments, \nfacilities and benefits accorded to the IO / Dy. IO, once determined, shall not be changed \nadversely during the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(b) of \nthe Directions, of the bank administratively, and to the Customer Service Committee of \nthe Board of the bank functionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe bank shall provide such number of its officers and staff to the office of the IO \nas is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge the \nresponsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the bank.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the bank shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of the \nhuman resources and infrastructure provided to the office of the IO in relation to \nthe volume of complaints; \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n \n7 \n \n(c) Action taken by the office of the IO with regard to analysis of complaints, reports \nsubmitted to the Reserve Bank of India and the bank, raising awareness of the \nstaff of the bank about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the bank to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness \nof decisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have already \nbeen examined by the bank but have been partially resolved or being wholly rejected by \nthe bank. \n(2)  \nThe IO / Dy. IO shall not represent the bank in legal cases before any court or fora \nor authority. \n(3)  \nWhile the IO may decide any or all complaints, the power for the Dy. IO to decide \nthe complaints may be defined under a policy approved by the Customer Service \nCommittee of the Board, as the case may be.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, if \nany, and as per the compensation policy of the bank, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank- \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered by \nthe complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the bank, such as product-wise, category-wise, consumer group-wise, \ngeographical location-wise, etc., and provide inputs to the bank for policy intervention, if \nso warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nbank.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \nOmbudsman / Appellate Authority. The bank shall seek such access for the IO / Dy. IO \nfrom the Consumer Education and Protection Department of the Reserve Bank.  \n \n9 \n \n(9)  \nThe Dy. IO shall functionally report to the IO. \n  \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the Customer \nService Committee of the Board. In banks having multiple IOs, a view shall be taken by \nthe Customer Service Committee of the Board to have representation of more than one \nIO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on his / \nher activities to the Customer Service Committee of the Board, preferably at quarterly, \nbut not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(b) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Customer Service Committee of the \nBoard of the bank for review.  \n(5)  \nInformation on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Customer Service \nCommittee of the Board, on quarterly basis. The information shall be accompanied with \nan analysis of minimum top five categories of complaints along with remedial measures \nso as to avoid complaints of a similar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n10 \n \nChapter - IV \nProcedural Guidelines for Bank \n \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nbank and access to the System shall be provided to the IO / Dy. IO. All complaints that \nare partially resolved or wholly rejected by the bank’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review;  \na) in case of complaints, for which Reserve Bank of India, National Payments \nCorporation of India, or card network guidelines prescribe a timeline for resolution, \nsufficiently in advance such that IO / Dy. IO gets at least 10 days for review of such \ncomplaints to enable final decision to be communicated to the complainants within \nthe timelines prescribed by Reserve Bank of India, National Payments Corporation \nof India, or card network, as applicable; \nb) in all other cases, within 20 days of receipt.  \n(2)  \nThe bank shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording the \ndecision on the complaints before escalation to the office of IO. The complaints outside \nthe purview of the IO / Dy. IO under the clauses 14(5)(c) to 14(5)(e) are exempted from \nsuch classification. \n(3)  \nThe bank shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe bank shall ensure that a complaint is not closed by the same branch / unit / \nother touch points, whether it has been resolved (fully or partially) or rejected. A complaint \nwhich is being wholly rejected or partially resolved shall be reviewed at a fairly senior \nlevel, which the bank may decide as deemed fit, before sending it to the office of IO.  \n(5)  \nThe following types of complaints shall be outside the purview of these Directions \nand shall not be handled by the IO/ Dy. IO: \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nbank that do not impact the customer in any manner; \n \n11 \n \nb) References in the nature of suggestions and commercial decisions of bank. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will be \nvalid complaints for the office of the IO;  \nc) Complaints / references relating to (i) internal administration, (ii) human resources, \nor (iii) pay and emoluments of staff in the bank; \nd) Complaints which have been decided by or are already pending in judicial / quasi-\njudicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe bank shall forward all rejected / partially resolved complaints under the categories \n(a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in service in \nsuch cases and take a view whether any of these complaints can be exempted under (a) \nand / or (b) above as decided by the bank. Complaints that are outside the purview of \nthese Directions shall be immediately returned back to the bank by the IO / Dy. IO. \n(6)  \nThe IO / Dy. IO shall examine the complaints based on records available with the \nbank, including any documents submitted by the complainant and comments/ \nclarifications furnished by the bank to the specific queries of the IO.  \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the bank \nand seek any additional record / document available with the bank that are necessary for \nexamining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe bank shall ensure that the final decision is communicated to the complainant \nwithin a period of 30 days from the date of receipt of complaint by the bank.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n(11)  Where the IO / Dy. IO upholds the decision of the bank to reject or partially resolve \nthe complaint, the reply to the complainant should explicitly state that the said complaint \nhas been reviewed by the IO / Dy. IO.  \n(12)   For complaints that are partially resolved or wholly rejected after examination by \nthe IO / Dy. IO, the bank shall advise the complainant about the option of approaching \nthe RBI Ombudsman for redress (excluding complaints not covered under the Reserve \n \n12 \n \nBank- Integrated Ombudsman Scheme, as amended from time to time) along with \ncomplete details of the complaint. The bank in its reply shall also mention the URL of \nReserve Bank’s Complaint Management System portal for online filing of customer \ncomplaints (https://cms.rbi.org.in) and the physical / email address of the Centralised \nReceipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO / \nDy. IO shall be mandatorily included in the information to be submitted by the bank to the \nRBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In case, the \ncomplaint was not earlier reviewed by the IO / Dy. IO, the bank shall necessarily seek \nhis/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The bank shall use the analysis of complaints handled by IO / Dy. IO in the training \nprogrammes / conferences to raise awareness about the pattern of complaints including \nthe root causes, remedial measures, etc., among the frontline staff, in order to evolve \nconsistency in handling of complaints. The IO / Dy. IO may also be involved in such \ntrainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the \nbank in the redress of complaints, the Customer Service Committee of the Board shall \nalso analyse the number of cases where there is substantive difference between the \ndecisions of the IO / Dy. IO vis-à-vis those given by the RBI Ombudsman subsequently. \n(16)  The bank shall widely disseminate the guidelines / instructions regarding these \nDirections among the staff while communicating the appointment of IO/ Dy. IO within the \norganization (all branches and administrative offices). \n(17)  The bank shall not provide the contact details of the IO / Dy. IO in the public domain \nas the IO / Dy. IO shall not handle complaints received directly from the customers. \n \n \n \n \n \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n13 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by \nthe Department of Supervision of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may review \nthe cases where the decision of the IO / Dy. IO has not been accepted by the bank and \nthe aggrieved complainant approaches the RBI Ombudsman, for assessing the \neffectiveness of the internal grievance redress mechanism of the bank and initiating \ncorrective actions as it may deem fit. \n \n16. Reporting to Reserve Bank  \n(1)  The bank shall, within five working days of appointment of the IO or Dy. IO, furnish \nthe details of the official so appointed to the Consumer Education and Protection \nDepartment, Central Office, Reserve Bank of India (email: iocepd@rbi.org.in) in the \nfollowing format: \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2)  The bank shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of India, \non a quarterly basis as per format provided in the Annexure. The report shall be \nsubmitted on or before the 15th day of the month following the quarter to which it relates \nto. \n \n \n14 \n \nChapter - VI \nRepeal Provisions \n17. Repeal of the existing Schemes  \n(1)  \nWith the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 \nissued by the Reserve Bank stands repealed.  \n(2)  \nAll appointments / actions under the aforesaid Master Direction, prior to the \ncoming into effect of these Directions, shall be deemed to have been made under these \nDirections. \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n15 \n \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended :  \nName of the Bank : \nPart I : Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No Particulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n \n8 \nOf (4 & 5), number of complaints wholly rejected \n \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \n \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n20 days of receipt \n \n \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 20 \ndays of receipt  \n \n \n13 \nOf (12), number of complaints referred to the IO / Dy.IO \nbeyond 20 days due to Turnaround Time prescribed by RBI, \nNPCI or card networks  \n \n \n14 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n \n \n15 \nOf (14), number of complaints where IO / Dy.IO has upheld the \ndecision of the bank \n \n \n16 \nOf (14), number of complaints where IO / Dy.IO has not upheld \nthe decision of the bank \n \n \n17 \nOf (16), number of complaints where the decision of the IO / \nDy.IO implemented by the bank \n \n \n \n16 \n \nS.No Particulars \nNumber \n18 \nOf (16), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n19 \nOf (16), number of complaints where the bank has disagreed \nwith the decision of IO / Dy.IO, with the approval of the \nCompetent Authority \n \n \n20 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n21 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n \n \n22 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n \n23 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Customer Service \nCommittee of the Board. \n \n \n",
    "extracted_links": [
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13164",
        "context": "Reserve Bank of India (Small Finance Banks - Branch Authorisation) Directions, 2025 issued by Reserve Bank of India, and as amended from time to time;"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13164",
        "context": "2025 (b) “Competent"
      },
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in)"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Directions, 2023 dated December 29, 2023"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      }
    ],
    "important_dates": [
      {
        "date": "January 14, 2026",
        "context": "January 14, 2026    Reserve Bank of India (Small Finance"
      },
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      },
      {
        "date": "March 31, 2025",
        "context": "or more banking  outlets in India as on March 31, 2025.   (2)   The directions shall also be a"
      },
      {
        "date": "March 31, 2025",
        "context": "ets  the above mentioned criteria after March 31, 2025, with effect from six months from  meet"
      },
      {
        "date": "December 29, 2023",
        "context": "ulated Entities) Directions, 2023 dated December 29, 2023  issued by the Reserve Bank stands repe"
      }
    ]
  },
  {
    "title": "Reserve Bank of India (Commercial Banks - Internal Ombudsman) Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/380MD14012026DAD56B73DC944F02AEA4530EC779AD7F.PDF",
    "file_extracted_text": " \n \n      \nभारतीय įरज़वर् बैंक \nRESERVE BANK OF INDIA \n \n  \n \n  \n  \n \n \n \nRBI/CEPD/2025-26/381 \nCEPD.PRD.No.S1027/13.01.019/2025-26                                      January 14, 2026 \n \nReserve Bank of India (Commercial Banks - Internal Ombudsman) Directions, \n2026 \n \nIn exercise of the powers conferred by Section 35A of Banking Regulation Act, 1949, \nthe Reserve Bank of India, being satisfied that it is necessary and expedient in the \npublic interest so to do, hereby, issues the Directions hereinafter specified. \n \nThese Directions are issued with a view to strengthen the Internal Grievance Redress \nmechanism within a bank and ensure a speedy and meaningful resolution of customer \ncomplaints by enabling a review before their rejection, by an apex level authority within \nthe bank.  \n \nChapter I  \nPreliminary \n \n1. Short Title and Commencement  \n(1)  \nThese Directions shall be called the Reserve Bank of India (Commercial Banks \n- Internal Ombudsman) Directions, 2026.  \n(2)  \nThese Directions shall come into force with immediate effect except clause 7(2), \n14(2) and 14(4) which shall be complied with, latest by June 30, 2026.  \n \n2. Suspension  \n(1)  \nThe Reserve Bank, if it is satisfied that it is expedient so to do, may, by an order, \nsuspend for such period as may be specified in the order, the operation of any or all \nof the provisions of these Directions, either generally or in relation to any specified \nregulated entity. \n(2)  \nThe Reserve Bank may by an order, extend from time to time, the period of any \nsuspension ordered as aforesaid by such period, as it may deem fit. \n \n2 \n \n \n3. Applicability \n(1)  \nThese Directions shall be applicable to Commercial Banks (hereinafter \ncollectively referred to as 'banks' and individually as a 'bank') having 10 or more \nbanking outlets in India as on March 31, 2025, whether such bank is incorporated in \nIndia or outside India.  \nFor the purpose of these Directions, ‘Commercial Banks’ mean banking companies \n(other than Small Finance Banks, Payment Banks, and Local Area Banks), \ncorresponding new banks, and the State Bank of India, as defined respectively under \nclauses (c), (da), and (nc) of Section 5 of the Banking Regulation Act, 1949, but does \nnot include a bank in resolution or winding up or under directions.  \n(2)  \nThe directions shall also be applicable to the commercial bank, which meets \nthe above mentioned criteria after March 31, 2025, with effect from six months from \nmeeting the eligibility criteria.  \n \n4. Definitions  \n(1)  \nIn these Directions, unless the context states otherwise, the terms herein shall \nbear the meanings assigned to them as below: \n(a)  \n“Banking Outlet” is a fixed-point service delivery unit as defined under \nthe Reserve Bank of India (Commercial Banks - Branch Authorisation) \nDirections, 2025 issued by Reserve Bank of India, and as amended from time \nto time;  \n(b)  \n“Competent Authority” means Whole Time Director / Executive Director-\nin-charge of customer service vertical of the bank; \n(c)  \n“Complaint” means a representation in writing or through other modes \nalleging deficiency in service on the part of the bank with or without seeking \nrelief thereon;   \n(d)  \n“Credit Information Company (CIC)” means a company as defined in the \nCompanies Act, 2013 and has been granted a certificate of registration under \nsub-section (2) of section 5 of the Credit Information Companies (Regulation) \nAct, 2005; \n(e)  \n“Customer” means a person who uses, or is an applicant for, a service \nprovided by the bank; \n \n3 \n \n(f)  \n“Deficiency in service” means a shortcoming or an inadequacy in any \nservice, which the bank is required to provide statutorily or otherwise, which \nmay or may not result in financial loss or damage to the customer; \n(g)  \n“Deputy Internal Ombudsman (Dy. IO)” means any person appointed \nunder clause 6 of these Directions;  \n(h)  \n“Financial Sector Regulatory Body” means regulatory body for financial \nsector entities and includes: \n(i) The Reserve Bank of India established under the Reserve Bank of \nIndia Act, 1934; \n(ii) The Securities and Exchange Board of India established under the \nSecurities and Exchange Board of India Act, 1992; \n(iii) The Insurance Regulatory and Development Authority of India \nestablished under the Insurance Regulatory and Development Authority \nof India Act, 1999; \n(iv) The Pension Fund Regulatory and Development Authority \nestablished under the Pension Fund Regulatory and Development \nAuthority Act, 2013; \n(i)  \n“Internal Ombudsman (IO)” means any person appointed under clause \n5 of these Directions; \n(j)  \n“Regulated Entity (RE)” means a commercial bank or payments bank or \nsmall finance bank or a non-banking financial company or a non-bank prepaid \npayment instrument issuer or a credit information company which are covered \nunder the purview of the Internal Ombudsman framework, or any other entity \nas may be specified by the Reserve Bank from time to time.  \n \n(2)  All other expressions, unless defined herein, shall have the same meaning as \nassigned to them under the Banking Regulation Act, 1949, the Reserve Bank of \nIndia Act, 1934, the Payment and Settlement Systems Act, 2007, the Credit \nInformation Companies (Regulation) Act, 2005, the Credit Information Companies \nRules, 2006, the Credit Information Companies Regulations, 2006, or the Reserve \nBank - Integrated Ombudsman Scheme (as amended from time to time) or \nregulations, directions and guidelines issued by the Reserve Bank of India. \n \n \n4 \n \nChapter II \nOffice of the Internal Ombudsman \n \n5. Appointment of Internal Ombudsman \n(1)  \nThe IO shall either be a retired or serving officer, in the rank equivalent to a \nGeneral Manager in the RE of the Reserve Bank under the purview of the Internal \nOmbudsman framework or a Financial Sector Regulatory Body, having necessary \nskills and experience of minimum seven years of working in areas such as banking, \nnon-banking finance, regulation, supervision, payment and settlement systems, credit \ninformation or consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as IO. \n(2)  \nThe IO shall previously not have been employed, nor presently be employed, \nby the bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe IO shall not be over 70 years of age before the completion of the tenure. \n(4)   \nA person may work as the IO in more than one RE simultaneously at the \ndiscretion of the REs concerned, subject to the approval of the Board or Customer \nService Committee / Consumer Protection Committee of the Board of the appointing \nRE. \n \n6. Appointment of Deputy Internal Ombudsman  \n(1)  \nThe Dy. IO shall either be a retired or serving officer, in the rank equivalent to \na Deputy General Manager in the RE under the purview of the Internal Ombudsman \nframework or a Financial Sector Regulatory Body, having necessary skills and \nexperience of minimum five years of working in areas such as banking, non-banking \nfinance, regulation, supervision, payment and settlement systems, credit information \nor consumer protection.  \nProvided that, if the person is a serving officer, he / she is required to relinquish \nthe same before assuming charge as Dy. IO. \n(2)  \nThe Dy. IO shall previously not have been employed, nor presently be \nemployed, by the bank or a holding, associate or subsidiary company of the bank. \n(3)  \nThe Dy. IO shall not be over 70 years of age before the completion of the tenure. \n(4)  \nThe Dy. IO shall not be employed in more than one RE simultaneously. \n \n \n5 \n \n \n7.  Number of Internal Ombudsman / Deputy Internal Ombudsman  \n(1)   \nEvery bank shall appoint at least one IO.  \n(2)  \nThe Customer Service Committee of the Board of the bank shall determine, at \nleast once in a year, the number of IO/ Dy. IO to be appointed having due regard to \nvolume and complexity of the complaints received, and ensuring that the IO/ Dy. IO \nget sufficient time to apply his/her mind on the principles of fairness, equity and natural \njustice while reviewing the resolution provided by the bank. \n(3)  \nWhile appointing additional IO / Dy. IO, the bank shall consider the need for \ndiversity of experience of the incumbents to deal with different types of cases.  In such \ncases, the bank may clearly define the jurisdiction of each IO / Dy. IO.  \n \n8. Tenure of Internal Ombudsman / Deputy Internal Ombudsman \n(1)    The appointment of the IO / Dy. IO in the bank shall be contractual.  \n(2)  \nThe bank shall ensure that the post of the IO does not remain vacant at any \npoint of time. During the temporary absence of the IO, the Dy. IO may function as the \nIO.  \n(3)  \nIn a rare case where both IO/s and Dy IO/s are on leave / absent, the bank may \ndesignate its serving official equivalent to the General Manager rank as the IO for a \nperiod not exceeding one month, with the approval of the Customer Service \nCommittee of the Board. Such official shall not have any reporting relationship with the \nbusiness verticals of the bank during the period in which he/she is designated as the \nIO.  \n(4)  \nThe tenure of the IO / Dy. IO in the bank shall be a fixed term of not less than \nthree years. However, the total tenure (including extension/reappointment, if any) of \nthe IO / Dy. IO in the bank shall not exceed five years.  \n(5)  \nTo fill a vacancy, the bank shall undertake the process of fresh appointment at \nleast three months in advance of the expiry of the tenure of the incumbent IO and \nensure that there is a reasonable overlap between the time of demitting of office of the \noutgoing IO and the incoming IO.  \n(6)    The IO / Dy. IO shall not be removed before the completion of his/her \ncontracted term without the approval of the Customer Service Committee of the Board. \nIn case a vacancy arises on account of reasons beyond the control of the bank (such \n \n6 \n \nas resignation, incapacitation, illness, death, etc.), the bank shall inform Reserve Bank \nof India within 10 working days from the date of such vacancy and shall appoint a new \nIO / Dy. IO as per eligibility criteria specified under clause 5 and clause 6 of these \nDirections within three months from the date of vacancy.  \n(7)    The Customer Service Committee of the Board of the bank shall determine the \nstructure of emoluments, facilities and benefits accorded to the IO / Dy. IO, which \nshould be appropriate keeping in view the stature and position of the IO / Dy. IO being \nat the apex of the grievance redress mechanism of the bank as also the need to attract \nexperienced persons with requisite expertise. These emoluments, facilities and \nbenefits accorded to the IO / Dy. IO, once determined, shall not be changed adversely \nduring the tenure of the IO / Dy. IO. \n \n9. Administrative Oversight  \n(1)  \nThe IO shall report to the Competent Authority, as defined under clause 4(1)(b) \nof the Directions, of the bank administratively, and to the Customer Service Committee \nof the Board of the bank functionally. \n \n10. Secretariat of the office of Internal Ombudsman  \n(1)   \nThe bank shall provide such number of its officers and staff to the office of the \nIO as is considered necessary for the smooth functioning of the office of the IO.  \n(2)  \nAll other requisite office infrastructure, including information technology support \nshall be made available to the office of the IO to enable the IO/ Dy. IO to discharge \nthe responsibilities effectively and efficiently.  \n(3)  \nThe office of the IO may preferably be placed in the Head Office or Corporate \nOffice of the bank.  \n \n11. Internal Audit \n(1)  \nThe Internal Audit Department of the bank shall conduct an audit of the \nimplementation of these Directions on an annual basis, covering, inter-alia: \n(a) The process of appointment / reappointment of the IO/Dy. IO, adequacy of \nthe human resources and infrastructure provided to the office of the IO in \nrelation to the volume of complaints; \n \n7 \n \n(b) Implementation of auto-escalation of the partially resolved or wholly rejected \ncomplaints to the office of the IO within the timelines;  \n(c) Action taken by the office of the IO with regard to analysis of complaints, \nreports submitted to the Reserve Bank of India and the bank, raising awareness \nof the staff of the bank about the grievance redressal processes, and such other \nprocesses; \n(d) Submission of the information related to appointment of the IO / Dy. IO and \nsubmission of periodic report on the functioning of the IO by the bank to the \nReserve Bank. \n(2)  \nThe scope of the internal audit shall exclude any assessment of the correctness \nof decisions taken by the IO / Dy. IO. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n \nChapter – III \nRole and Responsibilities \n \n12. Role and Responsibilities of Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nThe office of the IO shall not handle complaints received directly from the \ncomplainants or members of the public. It shall deal with the complaints that have \nalready been examined by the bank but have been partially resolved or being wholly \nrejected by the bank. \n(2)  \nThe IO / Dy. IO shall not represent the bank in legal cases before any court or \nfora or authority. \n(3)   \nWhile the IO may decide any or all complaints, the power for the Dy. IO to \ndecide the complaints may be defined under a policy approved by the Customer \nService Committee of the Board.  \n(4)  \nThe IO / Dy. IO shall recommend suitable compensation to the complainant, as \nper the compensation prescribed by the Reserve Bank of India in its extant guidelines, \nif any, and as per the compensation policy of the bank, if any, in case there is no \nprescription from the Reserve Bank of India. \n(5)  \nThe IO may recommend compensation in accordance with the Reserve Bank- \nIntegrated Ombudsman Scheme, as amended from time to time, for any consequential \nloss and the loss of time, expenses incurred and harassment / mental agony suffered \nby the complainant, over and above the compensation recommended in clause 12(4). \n(6)  \nThe office of IO shall, on a quarterly basis, analyse the pattern of all complaints \nreceived against the bank, such as product-wise, category-wise, consumer group-\nwise, geographical location-wise, etc., and provide inputs to the bank for policy \nintervention, if so warranted.  \n(7)  \nThe IO shall suggest means for taking actions to address the root cause of \ncomplaints of similar / repeat nature and those that require policy level changes in the \nbank.  \n(8)  \nThe IO/ Dy. IO shall have ‘read-only’ access to the Reserve Bank’s Complaint \nManagement System to enable them to keep abreast of decisions of the RBI \nOmbudsman / Appellate Authority. The bank shall seek such access for the IO / Dy. \nIO from the Consumer Education and Protection Department of the Reserve Bank.  \n(9)  \nThe Dy. IO shall functionally report to the IO.  \n \n9 \n \n \n13. Board Oversight \n(1)  \nThe IO shall be designated as a permanent invitee to the meetings of the \nCustomer Service Committee of the Board. In banks having multiple IOs, a view shall \nbe taken by the Customer Service Committee of the Board to have representation of \nmore than one IO or having a system of rotation. \n(2)  \nThe IO shall furnish periodic reports (including the analysis of complaints) on \nhis / her activities to the Customer Service Committee of the Board, preferably at \nquarterly, but not less than half yearly, intervals.  \n(3)  \nThe decision of the IO / Dy. IO can be overruled only with the approval of the \nCompetent Authority as defined under clause 4(1)(b) of these Directions.  \n(4)  \nAll such cases where the decision of the IO / Dy. IO has been overruled by the \nCompetent Authority shall be placed before the Customer Service Committee of the \nBoard of the bank for review.  \n(5)   \nInformation on the complaints resolved by the RBI Ombudsman in favour of \ncomplainant, either partially or fully, shall also be placed before the Customer Service \nCommittee of the Board, on quarterly basis.  The information shall be accompanied \nwith an analysis of minimum top five categories of complaints along with remedial \nmeasures so as to avoid complaints of a similar nature in future. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n10 \n \nChapter - IV \nProcedural Guidelines for Bank \n \n14. Procedure for Complaint Redress by Internal Ombudsman / Deputy Internal \nOmbudsman \n(1)  \nA fully automated Complaints Management System shall be put in place by the \nbank and access to the System shall be provided to the IO / Dy. IO.  All complaints \nthat are partially resolved or wholly rejected by the bank’s internal grievance redress \nmechanism shall be auto escalated to the office of the IO for review;  \na) in case of complaints, for which Reserve Bank of India, National Payments \nCorporation of India, or card network guidelines prescribe a timeline for \nresolution, sufficiently in advance such that IO / Dy. IO gets at least 10 days for \nreview of such complaints to enable final decision to be communicated to the \ncomplainants within the timelines prescribed by Reserve Bank of India, National \nPayments Corporation of India, or card network, as applicable; \nb) in all other cases, within 20 days of receipt.  \n(2)  \nThe bank shall provide only three categories i.e. ‘Fully Resolved’, ‘Partially \nResolved’ and ‘Wholly Rejected’ in its Complaint Management System for recording \nthe decision on the complaints before escalation to the office of IO. The complaints \noutside the purview of the IO/ Dy. IO under the clauses 14(5)(c) to 14(5)(e) are \nexempted from such classification. \n(3)  \nThe bank shall formulate a Standard Operating Procedure (SOP) for flow of \ncomplaints and information in a time bound manner.  \n(4)  \nThe bank shall ensure that a complaint is not closed by the same branch/ unit/ \nother touch points, whether it has been resolved (fully or partially) or rejected. A \ncomplaint which is being wholly rejected or partially resolved shall be reviewed at a \nfairly senior level, which the bank may decide as deemed fit, before sending it to the \noffice of IO.  \n(5)   \nThe following types of complaints shall be outside the purview of these \nDirections and shall not be handled by the IO/ Dy. IO: \na) Complaints related to corporate frauds, misappropriation etc., on the part of the \nbank that do not impact the customer in any manner; \n \n11 \n \nb) References in the nature of suggestions and commercial decisions of bank. \nHowever, service deficiencies in cases falling under ‘commercial decisions’ will \nbe valid complaints for the office of the IO;   \nc) Complaints / references relating to (i) internal administration, (ii) human \nresources, or (iii) pay and emoluments of staff in the bank; \nd) Complaints which have been decided by or are already pending in judicial / \nquasi-judicial fora such as Courts, Consumer Disputes Redressal Commission, \nArbitration, etc.;  \ne) Disputes for which remedy has been provided under Section 18 of the Credit \nInformation Companies (Regulation) Act, 2005. \nThe bank shall forward all rejected / partially resolved complaints under the categories \n(a) and (b) above to the IO / Dy. IO, who shall look for inherent deficiency in service in \nsuch cases and take a view whether any of these complaints can be exempted under \n(a) and / or (b) above as decided by the bank. Complaints that are outside the purview \nof these Directions shall be immediately returned back to the bank by the IO / Dy. IO. \n(6)  \nThe IO/ Dy. IO shall examine the complaints based on records available with \nthe bank, including any documents submitted by the complainant and comments/ \nclarifications furnished by the bank to the specific queries of the IO.  \n(7)  \nThe IO/ Dy. IO may hold meetings with the concerned functionaries of the bank \nand seek any additional record / document available with the bank that are necessary \nfor examining the complaint and reviewing the decision.  \n(8)  \nThe IO / Dy. IO may, if they find it necessary, seek written or oral submission \n(including additional information and documents) from the complainant, through the \nsecretariat.  \n(9)  \nThe bank shall ensure that the final decision is communicated to the \ncomplainant within a period of 30 days from the date of receipt of complaint by the \nbank.  \n(10)  The IO / Dy. IO shall record a “reasoned decision” in each case.  \n(11)  Where the IO / Dy. IO upholds the decision of the bank to reject or partially \nresolve the complaint, the reply to the complainant should explicitly state that the said \ncomplaint has been reviewed by the IO / Dy. IO.  \n(12)   For complaints that are partially resolved or wholly rejected after examination \nby the IO / Dy. IO, the bank shall advise the complainant about the option of \n \n12 \n \napproaching the RBI Ombudsman for redress (excluding complaints not covered \nunder the Reserve Bank - Integrated Ombudsman Scheme, as amended from time to \ntime) along with complete details of the complaint. The bank in its reply shall also \nmention the URL of Reserve Bank’s Complaint Management System portal for online \nfiling of customer complaints (https://cms.rbi.org.in) and the physical / email address \nof the Centralised Receipt and Processing Centre1.  \n(13)   When a complaint is escalated to the RBI Ombudsman, the decision of the IO \n/ Dy. IO shall be mandatorily included in the information to be submitted by the bank \nto the RBI Ombudsman if the complaint was already reviewed by the IO / Dy. IO. In \ncase, the complaint was not earlier reviewed by the IO / Dy. IO, the bank shall \nnecessarily seek his/ her comments and submit the same to the RBI Ombudsman.  \n(14)   The bank shall use the analysis of complaints handled by IO / Dy. IO in the \ntraining programmes / conferences to raise awareness about the pattern of complaints \nincluding the root causes, remedial measures, etc., among the frontline staff, in order \nto evolve consistency in handling of complaints. The IO / Dy. IO may also be involved \nin such trainings, where necessary. \n(15)   While assessing the performance of the IO / Dy. IO, in addition to the level of \npendency and work done by the IO / Dy. IO towards developing uniformity across the \nbank in the redress of complaints, the Customer Service Committee of the Board shall \nalso analyse the number of cases where there is substantive difference between the \ndecisions of the IO / Dy. IO vis-à-vis those given by the RBI Ombudsman \nsubsequently. \n(16)  The bank shall widely disseminate the guidelines / instructions regarding these \nDirections among the staff while communicating the appointment of IO/ Dy. IO within \nthe organization (all branches and administrative offices). \n(17)  The bank shall not provide the contact details of the IO / Dy. IO in the public \ndomain as the IO / Dy. IO shall not handle complaints received directly from the \ncustomers. \n \n \n \n1 Centralized Receipt and Processing Centre (CRPC) Reserve Bank of India, Central Vista, Sector 17, \nChandigarh - 160 017 (email: crpc@rbi.org.in) \n \n13 \n \nChapter - V \nRegulatory and Supervisory Oversight by the Reserve Bank \n15. Supervisory Oversight \n(1)  \nThe areas relating to customer service and customer grievance redress, as well \nas the implementation of these Directions, shall be a part of the supervisory review by \nthe Department of Supervision of the Reserve Bank.  \n(2)  \nConsumer Education and Protection Department of the Reserve Bank may \nreview the cases where the decision of the IO / Dy. IO has not been accepted by the \nbank and the aggrieved complainant approaches the RBI Ombudsman, for assessing \nthe effectiveness of the internal grievance redress mechanism of the bank and \ninitiating corrective actions as it may deem fit. \n \n16.  Reporting to Reserve Bank  \n(1)    The bank shall, within five working days of appointment of the IO or Dy. IO, furnish \nthe details of the official so appointed to the Consumer Education and Protection \nDepartment, Central Office, Reserve Bank of India (email: iocepd@rbi.org.in) in the \nfollowing format: \n1. Name of the IO / Dy. IO  \n \n2. Details of the last positions held/ organisation  \n \n3. Date of Appointment / Reappointment \n \n4. Date of Birth \n \n5. Term (in years) \n \n6. Brief professional profile, including previous exposure to financial \nservices highlighting those that make them eligible for appointment \n \n7. Contact details (telephone, email, address) \n \n8. Date of intimation to the Reserve Bank \n \n \n(2)   The bank shall put in place a system of periodic reporting of information to the \nConsumer Education and Protection Department, Central Office, Reserve Bank of \nIndia, on a quarterly basis as per format provided in the Annexure. The report shall \nbe submitted on or before the 15th day of the month following the quarter to which it \nrelates to. \n \n \n14 \n \nChapter - VI \nRepeal Provisions \n17. Repeal of the existing Schemes  \n(1)  \nWith the issue of these Directions, the Master Direction - Reserve Bank of India \n(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, \n2023 issued by the Reserve Bank stands repealed.  \n(2)  \nAll appointments / actions under the aforesaid Master Direction, prior to the \ncoming into effect of these Directions, shall be deemed to have been made under \nthese Directions.  \n \n \n(Dr. Neena Rohit Jain)  \nChief General Manager \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n15 \n \nAnnexure  \nReport on functioning of the Internal Ombudsman \nReport for quarter ended:  \nName of the Bank: \nPart I: Information pertaining to the complaints referred to IO / Dy. IO \n \nS.No \nParticulars \nNumber \n1 \nNumber of Internal Ombudsman (IO) \n \n2 \nNumber of Deputy Internal Ombudsman (Dy.IO) \n \n3 \nNumber of staff assigned to the office of the IO (excluding \nDy.IO) \n \n4 \nNumber of complaints pending at the end of previous quarter \n \n5 \nNumber of complaints received during the quarter \n \n6 \nOf (4 & 5), number of complaints fully resolved \n \n7 \nOf (4 & 5), number of complaints partially resolved \n \n8 \nOf (4 & 5), number of complaints wholly rejected \n \n9 \nNumber of complaints partially resolved or wholly rejected \n(7)+(8) \n10 \nNumber of complaints pending at the end of the quarter \n \n \n \nIO \nDy. IO \n11 \nOf (9), number of complaints referred to the IO / Dy.IO within \n20 days of receipt \n \n \n12 \nOf (9) number of complaints referred to the IO / Dy.IO after 20 \ndays of receipt  \n \n \n13 \nOf (12), number of complaints referred to the IO / Dy.IO \nbeyond 20 days due to Turnaround Time prescribed by RBI, \nNPCI or card networks  \n \n \n14 \nOf (11 & 12), number of complaints where decision has been \nprovided by IO / Dy.IO \n \n \n15 \nOf (14), number of complaints where IO / Dy.IO has upheld the \ndecision of the bank \n \n \n16 \nOf (14), number of complaints where IO / Dy.IO has not upheld \nthe decision of the bank \n \n \n17 \nOf (16), number of complaints where the decision of the IO / \nDy.IO implemented by the bank \n \n \n18 \nOf (16), number of complaints where the decision of the IO / \nDy.IO is pending for implementation \n \n \n \n16 \n \nS.No \nParticulars \nNumber \n19 \nOf (16), number of complaints where the bank has disagreed \nwith the decision of IO / Dy.IO, with the approval of the \nCompetent Authority \n \n \n20 \nNumber of complaints which were resolved by the RBI \nOmbudsman and not referred to the IO/ Dy.IO earlier  \n \n \n21 \nNumber of complaints where the decisions of the IO / Dy.IO \nwere not upheld by the RBI Ombudsman \n \n \n22 \nNumber of complaints in which the IO / Dy. IO sought inputs \nfrom the complainants directly for resolution of complaints \n \n \n23 \nNumber of complaints in which the IO / Dy. IO provided \ncompensation \n \n \n \n \nPart II: Information pertaining to Root Cause Analysis by the IO  \n1. Major findings from the Root Cause Analysis \n2. Details of the suggestions made by the IO and accepted by the Customer Service \nCommittee of the Board. \n \n \n",
    "extracted_links": [
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13164",
        "context": "Reserve Bank of India (Commercial Banks - Branch Authorisation) Directions, 2025 issued by Reserve Bank of India, and as amended from time"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=13164",
        "context": "Directions, 2025 to time;"
      },
      {
        "url": "https://cms.rbi.org.in/",
        "context": "(https://cms.rbi.org.in) and Processing Centre1."
      },
      {
        "url": "mailto:crpc@rbi.org.in",
        "context": "Processing Centre (CRPC) crpc@rbi.org.in)"
      },
      {
        "url": "mailto:iocepd@rbi.org.in",
        "context": "iocepd@rbi.org.in)"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "Master Direction - Reserve Bank of India Entities) Directions, 2023 dated December 29,"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "(Internal Ombudsman for Regulated Entities) Directions, 2023 dated December 29, 2023 issued by the Reserve Bank stands repealed."
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=12586",
        "context": "2023 (2)"
      }
    ],
    "important_dates": [
      {
        "date": "January 14, 2026",
        "context": "26                                      January 14, 2026    Reserve Bank of India (Commercial Ba"
      },
      {
        "date": "June 30, 2026",
        "context": "which shall be complied with, latest by June 30, 2026.     2. Suspension   (1)   The Reserve"
      },
      {
        "date": "March 31, 2025",
        "context": "or more  banking outlets in India as on March 31, 2025, whether such bank is incorporated in"
      },
      {
        "date": "March 31, 2025",
        "context": "ets  the above mentioned criteria after March 31, 2025, with effect from six months from  meet"
      }
    ]
  },
  {
    "title": "Modified Interest Subvention Scheme for Short Term Loans for Agriculture and Allied Activities availed through Kisan Credit Card (KCC) during the financial year 2025-26",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NOTI1937CBBEFD2D3BC4E3CA7090BA7079BD859.PDF",
    "file_extracted_text": "िवत् तीय समावेशन और िवकास िवभाग,कᱶᮤीय कायार्लय, 10वीमंिजल, कᱶᮤीय कायार्लय भवन, पो.बा.सं.10014, मुंबई 400 001 \nटेलीफोन /Tel.No: 91-22-22661000 फैक्स/FaxNo: 91-22-22621011/22610948/22610943 \n ई-मेल/ Email ID:cgmincfidd@rbi.org.in \nFinancial Inclusion & Development Department, Central Office, 10thFloor, C.O. Building, Post Box No.10014, Mumbai 400 001 \nᳲहंदी आसान है, इसका ᮧयोग बढ़ाइये \n \n“चेतावनी\n :\n -\n \nᳯरज़वर् बᱹक ᳇ारा\nमेल, डाक, एसएमएस या फोन कॉल के जᳯरए ᳰकसी कᳱ भी व् यिᲦगत जानकारी जैसे बᱹक के खाते का ब् यौरा, पासवडर् आᳰद नहᱭ मांगी \nजाती है। यह धन रखने या देने का ᮧस् ताव भी नहᱭ करता है। ऐसे ᮧस् तावᲂ का ᳰकसी भी तरीके से जवाब मत दीिजए।\" \nCaution: RBI never sends mails, SMSs or makes calls asking for personal information like bank account details,  passwords, etc. It never keeps or \noffers funds to anyone. Please do not respond in any manner to such offers. \n \n  \n \n \n \n         भारतीय ǐरज़वर् बैंक  \n______________________ RESERVE BANK OF INDIA________________________ \n    www.rbi.org.in \nRBI/2025-26/193 \nFIDD.CO.FSD.BC.No.10/05.02.001/2025-26                                         January 13, 2026 \n \nThe Chairman/Managing Director/Chief Executive Officer \nAll Public Sector Banks, Private Sector Banks and \nSmall Finance Banks \n \nMadam/Dear Sir, \n \nModified Interest Subvention Scheme for Short Term Loans for Agriculture and \nAllied Activities availed through Kisan Credit Card (KCC) during the financial year \n2025-26 \n \nPlease refer to our circular FIDD.CO.FSD.BC.No.8/05.02.001/2024-25 dated August 06, \n2024 conveying the decision of the Government of India for continuation of the Modified \nInterest Subvention Scheme for short term loans for agriculture and allied activities for \nthe year 2024-25. \n2. In this regard, it is advised that Government of India has approved the continuation of \nthe Modified Interest Subvention Scheme (MISS) for the financial year 2025-26 with the \nfollowing stipulations: \n(i) \nIn order to provide short term crop loans and short term loans for allied activities \nincluding animal husbandry, dairy, fisheries, bee keeping etc. upto an overall limit \nof ₹3 lakh to farmers through KCC at concessional interest rate during the year \n2025-26, it has been decided to provide interest subvention to lending institutions \nviz. Public Sector Banks (PSBs) and Private Sector Banks (in respect of loans \ngiven by their rural and semi-urban branches only), Small Finance Banks (SFBs) \nबेटी बचाओ \nबेटी पढ़ाओ \n2 \n \nand computerized Primary Agriculture Cooperative Societies (PACS) ceded with \nScheduled Commercial Banks (SCBs), on use of their own resources. This \ninterest subvention will be calculated on the loan amount from the date of its \ndisbursement/drawal/renewal up to the date of actual repayment of the loan by \nthe farmer or up to the tenure/ due date/renewal of loans fixed by the \nbanks/PACS, whichever is earlier, subject to a maximum period of one year. The \napplicable lending rate to farmers and the rate of interest subvention for the \nfinancial year 2025-26 will be as follows: \n \nFinancial Year \nLending rate to \nfarmers \nRate of Interest Subvention \nto Lending Institutions \n2025-26 \n7% \n1.50% \n \n(ii) \nAn additional interest subvention of 3% per annum will be provided to such of \nthose farmers repaying in time, i.e., from the date of disbursement/drawl/renewal \nof the loan/s upto the actual date of repayment/tenure/due date or upto the due \ndate fixed by the banks for repayment of such loan/s, whichever is earlier, subject \nto a maximum period of one year from the date of disbursement. This also implies \nthat the farmers repaying promptly as above would get short term crop loans \nand/or short term loans for allied activities including animal husbandry, dairy, \nfisheries, bee keeping etc. @ 4% per annum during the financial year 2025-26. \nThis benefit would not accrue to those farmers who repay their agri loans after \none year of availing such loans. \n(iii) \nInterest subvention and prompt repayment incentive benefits on short term crop \nloans and short term loans for allied activities will be available on an overall limit \nof ₹3 lakh per annum subject to a maximum sub-limit of ₹2 lakh per farmer in \nrespect of those farmers involved only in activities related to animal husbandry, \ndairy, fisheries, bee keeping etc. The limit for crop loan component will take \npriority for interest subvention and prompt repayment incentive benefits and the \nresidual amount will be considered towards allied activities including animal \nhusbandry, dairy, fisheries, bee keeping etc. subject to the cap as mentioned \nabove. (Illustrations) \n3 \n \n(iv) \nIn order to discourage distress sale by farmers and to encourage them to store \ntheir produce in warehouses, the benefit of interest subvention under KCC will be \navailable to small and marginal farmers for a further period of upto six months \npost the harvest of the crop against negotiable warehouse receipts on the produce \nstored in warehouses accredited with Warehousing Development Regulatory \nAuthority (WDRA), at the same rate as applicable to the crop loan from the date \nof pledge. \n(v) \nTo provide relief to farmers affected by natural calamities, the applicable rate of \ninterest subvention for that year will be made available to banks for the first year \non the restructured loan amount. Such restructured loans will attract normal rate \nof interest from the second year onwards. \n(vi) \nHowever, to provide relief to farmers affected due to severe natural calamities, \nthe applicable rate of interest subvention for that year will be made available to \nbanks for first three years/entire period (subject to a maximum of five years) on \nthe restructured loan amount. Further, in all such cases, the benefit of prompt \nrepayment incentive @3% per annum shall also be provided to the affected \nfarmers. The grant of such benefit in cases of severe natural calamities shall, \nhowever, be decided by a High Level Committee (HLC) based on the \nrecommendations of the Inter-Ministerial Central Team (IMCT) and Sub \nCommittee of National Executive Committee (SC-NEC). \n3. Further, banks are advised to adhere to the following stipulations: \n(i) \nMandatory Aadhaar Authentication: Aadhaar seeding and authentication are \nmandatory for availing benefits under the scheme. All lending institutions must \nensure that e­KYC is completed for every farmer to enable seamless access to \nscheme benefits. \n(ii) \nValidation of Multiple Accounts of beneficiaries: A farmer shall be eligible to \nreceive MISS benefit through multiple KCC subject to an overall limit of ₹3 lakh per \nfarmer across all such accounts. However, he/she shall be eligible to receive MISS \nbenefits for a specific land parcel through only one Kisan Credit Card (KCC) \naccount. In cases where a farmer maintains multiple KCC accounts linked to the \n4 \n \nsame land parcel, MISS benefit shall be extended only to the account with the \nhighest sanctioned loan amount, subject to the overall limit. \n(iii) \nEncouraging Digital Transactions: Banks may encourage farmers to utilize all \navailable digital banking channels, including RuPay cards, for seamless account \noperations and transactions. \n(iv) \nReporting of Data: Banks are advised to capture and report the requisite granular \ndata of individual farmer beneficiaries under the scheme, including their social \ncategory, on the KRP and ensure that such data is not changed in subsequent \nperiods. This data should be reported accurately to facilitate the settlement of \naudited MISS claims for the year 2025–26. \n(v) \nAccurate Crop Reporting on KRP: Field functionaries must exercise due \ndiligence in accurately reporting the data on crops sown on the KRP. Failure to do \nso may lead to validation errors at a later stage. \n(vi) \nSubmission of MISS Claims on KRP: All eligible financial institutions shall strictly \nfollow the operational instructions and ensure timely uploading of MISS claims on \nKRP, duly certified by their Statutory Auditors as true and correct, as per date \nnotified from time to time. \n(vii) \nSubmission of Claims by PACS Ceded with SCBs: The claims in respect of \ncomputerized PACS ceded with SCBs may be uploaded separately by the \nrespective banks, with the certification that interest subvention/prompt repayment \nincentive is being claimed on loans for which no refinance has been availed from \nNABARD, duly certified by the banks’ Statutory Auditors, through KRP module.  \nYours faithfully, \n \n(R. Giridharan) \nChief General Manager \n \n \n \n5 \n \nIllustrations \n \nIllustration I \n \nOverall KCC limit - ₹2.5 lakh  \nLimit under Crop loan - ₹1.5 lakh \nSub-limit under Animal Husbandry and/or Dairy and/or Bee keeping and/or Fisheries – ₹1 lakh \n  IS and PRI benefit will be available on overall ₹2.5 lakh i.e. \n• ₹1.5 lakh -Crop loan + ₹1 lakh- Animal Husbandry and/or Dairy and/or Bee keeping and/or \nFisheries \n \nIllustration II \n \nOverall KCC limit - ₹3 lakh \nLimit under Crop loan - ₹0.5 lakh \nSub-limit under Animal Husbandry and/or Dairy and/or Bee keeping and/or Fisheries – ₹2.5 lakh \nIS and PRI benefit will be available on overall ₹2.5 lakh i.e. \n• ₹0.5 lakh - Crop loan + ₹2 lakh - Animal Husbandry and/or Dairy and/or Bee keeping and/or \nFisheries \n \nIllustration III \n \nOverall KCC limit - ₹4 lakh  \nLimit under Crop loan - ₹1.75 lakh \nSub-limit under Animal Husbandry and/or Dairy and/or Bee keeping and/or Fisheries– ₹2.25 lakh \nIS and PRI benefit will be available on overall ₹3 lakh i.e. \n• ₹1.75 lakh -Crop loan + ₹1.25 lakh - Animal Husbandry and/or Dairy and/or Bee keeping and/or \nFisheries \n \nIllustration IV \n \nOverall KCC limit - ₹4.5 lakh  \nLimit under Crop loan - ₹2 lakh \nSub-limit under Animal Husbandry and/or Dairy and/or Bee keeping and/or Fisheries – ₹2.5 lakh \nIS and PRI benefit will be available on overall ₹3 lakh i.e. \n• ₹2 lakh - Crop loan + ₹1 lakh - Animal Husbandry and/or Dairy and/or Bee keeping and/or \nFisheries \n \nIllustration V \n \nOverall KCC limit - ₹4 lakh \nLimit under Crop loan - ₹3.15 lakh \nSub-limit under Animal Husbandry and/or Dairy and/or Bee keeping and/or Fisheries – ₹0.85 lakh \nIS and PRI benefit will be available on overall ₹3 lakh for crop loan component only \n******* \n",
    "extracted_links": [
      {
        "url": "https://www.rbi.org.in/",
        "context": "RESERVE BANK OF www.rbi.org.in"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/NotificationUser.aspx?Id=12717&Mode=0",
        "context": "circular FIDD.CO.FSD.BC.No.8/05.02.001/2024-25 dated August 06, the decision of the Government of India for continuation of the Modified"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/NotificationUser.aspx?Id=12717&Mode=0",
        "context": "2024 Interest"
      }
    ],
    "important_dates": [
      {
        "date": "January 13, 2026",
        "context": "January 13, 2026    The Chairman/Managing Director/Chief"
      }
    ]
  },
  {
    "title": "Foreign Exchange Management (Guarantees) Regulations, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/GUARANTEEREGULATIONS120120264A3C04579A554DC083C1FBEA87D0C30E.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496381431>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Foreign Exchange Management (Guarantees) Regulations, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/APPDIR191201202690F6A48208144E70817236152282BA14.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496589431>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (All India Financial Institutions (AIFIs) - Prudential Norms on Capital Adequacy) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1918F190EB952FE47CB90130C1F94C31449.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432495159154>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Small Finance Banks - Prudential Norms on Capital Adequacy) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT190BE288766BD854E35B5FF846BFA14F86C.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496593031>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Commercial Banks - Prudential Norms on Capital Adequacy) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT189F6DD440E5A6548BE9687EE60591F8B40.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496387767>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (All India Financial Institutions – Financial Statements: Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT188EB68AFA1DD164219A8E1B978065DD2F3.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432494861937>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies – Financial Statements: Presentation and Disclosures) Directions, Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT187BBC225408A29464BAB60ECD7DA3FFEA1.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432493629523>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Rural Co-operative Banks  – Financial Statements: Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1863CDA451CED9546B2B2B3B22D1766AF25.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432497444653>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Urban Co-operative Banks – Financial Statements: Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT185FBE16D01DEC34469B8EA4A18B594CC2F.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432495283637>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Regional Rural Banks – Financial Statements:  Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1843C9720E263C64D27BBF943566AC61047.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432494794326>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Local Area Banks – Financial Statements:  Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT183A77FCD0480904C8383C0CFF331112985.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432493638451>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Small Finance Banks – Financial Statements:  Presentation and Disclosures) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT18277D92A87A9C84C9DA0CE951CB9388EE2.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432482300108>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Commercial Banks – Financial Statements:  Presentation and Disclosures) – Second Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT181380D29E452BB410A98108DFE4B305BF4.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432482300972>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (All India Financial Institutions – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1808BCC3640F32F46C2BA789CB2604FBE63.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432493643635>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT179E8A0C46758CC48778CD80D7D52D1463A.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432497456749>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Rural Co-operative Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT178B1FF8BF029554D7BB04EC472AE5A03EE.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496347018>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Urban Co-operative Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT177F75338772AAE4E6B8EA41A49AEC8FB09.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432497459629>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Regional Rural Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT176A02DF87734FD4B01BB922EA99A11E8B5.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432497461213>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Local Area Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT175A4E1C0D637A3478A82A9BB5EF3308349.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496788521>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Small Finance Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT174B6567DC94D0C4542A6B08B1F3916FA6B.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496409727>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Commercial Banks – Credit Risk Management) – Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT173F05694DEF361460C844D54AD4C908A87.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496356522>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Returns – Department of Payment and Settlement Systems – Submission in CIMS",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT172567C1B9091D1472B98099DD39DFF8032.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496793345>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Returns – Department of Payment and Settlement Systems – Submission in CIMS",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT17160D6610A7C89471CA1AF09F193AB55AA.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432494638672>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Returns – Department of Payment and Settlement Systems – Submission in CIMS",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT170E0D7F0C6C6714831A94468881331E24C.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <7431742884589729973>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies - Concentration Risk Management) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT169CA989972B98849EDA8B22DF884095897.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432482316380>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies – Prudential Norms on Capital Adequacy) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1685150F71B60FB49C9B8EA36FC9D82ED1C.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496368114>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Commercial Banks - Financial Statements: Presentation and Disclosures) Amendment Directions, 2026",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT167DA8E2AE1C6D949C694D021775A7641B4.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432482320844>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Commercial Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1668608B65943A84A6AB149066C619DBF6E.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <7431742884589734941>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Urban Co-operative Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT165B30E6889DE804CB6981BA9483B27AD4D.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <7431742884589736165>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Small Finance Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT1642396D657812C49B9B73A882CD07E1D65.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432493667899>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Rural Co-operative Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT163838C872EF1554D30A341F7773A621E15.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496819769>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Regional Rural Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT162A94D9CA80BD04DF2BFD716D6C872893E.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496376754>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Payments Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT161492982C0947A46F2921DD44054B11AB0.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432493670779>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Non-Banking Financial Companies – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT160A366EA8052104F0ABD04B9DAD153E3F9.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432497806742>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Local Area Banks – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NOTI159646CE073DC904986AEE05400ECD62D2A.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496825889>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (Asset Reconstruction Companies – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT15843E9C00E46BC42C8AAF72AD2CEE071E6.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496438455>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  },
  {
    "title": "Reserve Bank of India (All India Financial Institutions – Know Your Customer) Amendment Directions, 2025",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT157BD14CBA3310840B382FED88371E675CA.PDF",
    "file_extracted_text": "The requested URL was rejected. Please consult with your\nadministrator.\nYour support ID is: <10600361432496440327>\n[Go Back]\n",
    "extracted_links": [
      {
        "url": "javascript:history.back();",
        "context": "[Go Back]"
      }
    ],
    "important_dates": []
  }
]