[
  {
    "title": "Aadhaar Enabled Payment System – Due Diligence of AePS Touchpoint Operators",
    "file_pdf_link": "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/NT63467C7E2AC96C4F1F88CC91C49CF18BEC.PDF",
    "file_extracted_text": " \nRBI/2025-26/63 \nCO.DPSS.POLC.No.S339/02-01-001/2025-2026                              June 27, 2025 \n \nThe Chairman / Managing Director / Chief Executive \nAll Scheduled Commercial Banks including RRBs / \nUrban Cooperative Banks / State Cooperative Banks / District Central Cooperative \nBanks / National Payments Corporation of India (NPCI)  \n \nMadam / Dear Sir, \nAadhaar Enabled Payment System – Due Diligence of AePS Touchpoint \nOperators \nAadhaar Enabled Payment System (AePS) is a payment system operated by National \nPayment Corporation of India (NPCI) that facilitates interoperable transactions using \nAadhaar enabled authentication. AePS plays a prominent role in enabling financial \ninclusion. \n2. In recent times, there have been reports of frauds perpetuated through AePS due \nto identity theft or compromise of customer credentials. To protect bank customers \nfrom such frauds, and to maintain trust and confidence in the safety and security of \nthe system, a need is felt to enhance the robustness of AePS. Accordingly, as \nannounced in Statement on Developmental and Regulatory Policies dated February \n08, 2024, it has been decided to issue directions for streamlining the process for \nonboarding of AePS touchpoint operators and strengthening fraud risk management. \nDetailed instructions are placed in the Annex.    \n3. These directions are issued under Section 18 read with Section 10(2) of the \nPayment and Settlement Systems (PSS) Act, 2007 (Act 51 of 2007) and shall come \ninto effect from January 01, 2026. \nYours faithfully, \n(Gunveer Singh) \nChief General Manager-in-Charge \n \nEncl.: Annex \n \nAnnex \nCO.DPSS.POLC.No.S339/02-01-001/2025-2026                         \nJune 27, 2025 \nAadhaar Enabled Payment System -  \nDue Diligence of AePS Touchpoint Operators  \n1. Definitions \nI. In these directions, the terms herein shall bear the meanings assigned to them \nbelow: \na. Aadhaar Enabled Payment System (AePS): It is a Payment System in which \ntransactions are enabled through Aadhaar number and biometrics or OTP \nauthentication providing financial services such as cash withdrawal, cash \ndeposit, fund transfer, and non-financial services such as mini statement and \nbalance enquiry. etc. \nb. Acquiring bank: The bank which onboards the AePS touchpoint operators. \nc. AePS Touchpoint: The terminal deployed by acquirer banks to facilitate \nAePS transactions, which shall include both mobile and fixed points.  \nd. AePS Touchpoint Operator (ATO): The individual onboarded by the \nacquiring bank who operates the AePS touchpoint. \nII. \nTerms pertaining to Aadhaar, Aadhaar biometric authentication, etc., shall have \nthe same meaning as assigned to them in the Aadhaar (Targeted Delivery of \nFinancial and Other Subsidies, Benefits and Services) Act, 2016 (18 of 2016), \nand the rules made thereunder. \nIII. \nWords and expressions used but not defined in I and II above and defined in \nthe Payment and Settlement Systems Act, 2007 shall have the meanings \nassigned to them in that Act.  \n2. Due diligence of AePS Touchpoint Operators \n2.1 The acquiring bank shall carry out due diligence of all ATOs before onboarding \nthem, adopting the same process as indicated in the Customer Due Diligence \nprocedure for individuals, stipulated in paragraph 16 of Part-I, Chapter-VI of the \nMaster Direction – Know Your Customer Direction, 2016 (as updated from time \nto time), issued by the Reserve Bank.  However, if the due diligence of ATOs \nhas already been done in their capacity as Business Correspondent / sub-\nagent, then the same may be adopted. The acquiring bank shall also carry out \nperiodic updation of KYC of ATOs. \n2.2 In cases where an ATO has remained inactive, i.e. has not performed any \nfinancial / non-financial transaction for a customer for a continuous period of \nthree months, acquiring bank shall carry out KYC of ATO before enabling him / \nher to transact further.  \n3. Risk Management  \n3.1 The acquiring bank shall monitor the activities of ATOs through their \ntransaction monitoring systems on an ongoing basis and set operational \nparameters, based on business risk profile of the ATOs. Aspects such as location \nand type of the ATO, volume and velocity of transactions, etc. shall form part of \nbank’s fraud risk management framework.  \n3.2 The operational parameters regarding ATOs shall be reviewed on a periodic \nbasis, reflecting emerging fraud trends. \n3.3 The acquiring bank shall put in place adequate system level controls to ensure \nthat any technological integrations like APIs are used only for enabling AePS \noperations. \n*** \n \n",
    "extracted_links": [
      {
        "url": "https://rbi.org.in/Scripts/BS_PressReleaseDisplay.aspx?prid=57276",
        "context": "Statement on Developmental and Regulatory Policies dated February has been decided to issue directions for streamlining the process for"
      },
      {
        "url": "https://rbi.org.in/Scripts/BS_PressReleaseDisplay.aspx?prid=57276",
        "context": "08, 2024, onboarding"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=11566#12",
        "context": "Customer Due Diligence of Part-I, Chapter-VI of the"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=11566#12",
        "context": "procedure for individuals, stipulated in paragraph 16 of Part-I, Chapter-VI of the Master Direction – Know Your Customer Direction, 2016 (as updated from time"
      },
      {
        "url": "https://www.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=11566#12",
        "context": "Master Direction – Know Your Customer Direction, 2016 to time), issued by the Reserve Bank. However, if the due"
      }
    ],
    "important_dates": [
      {
        "date": "June 27, 2025",
        "context": "/2025-2026                              June 27, 2025    The Chairman / Managing Director / C"
      },
      {
        "date": "January 01, 2026",
        "context": "2007) and shall come  into effect from January 01, 2026.  Yours faithfully,  (Gunveer Singh)  C"
      },
      {
        "date": "June 27, 2025",
        "context": "-001/2025-2026                          June 27, 2025  Aadhaar Enabled Payment System -   Due"
      }
    ]
  }
]